Если Источник.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПроведениеВзаимозачета Тогда
	
	Отказ = Истина;
	
ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
	ЭтоДебиторскаяЗадолженность = Источник.СуммыДолга.НайтиСтроки(ПараметрыОтбора).Количество();
	
	Если ЭтоДебиторскаяЗадолженность Тогда
		Значение = ПланыСчетов.ПланСчетовБУ.НайтиПоКоду("91.02");
	КонецЕсли;
	
Иначе
	
	Значение = ПланыСчетов.ПланСчетовБУ.НайтиПоКоду("91.01");
	
КонецЕсли;