Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
	Объект.СтатьяДвиженияДенежныхСредств = Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
КонецЕсли;
сообщить("1 после загрузки");
Если Не ОбъектНайден и Не Объект.Проведен Тогда
	Параметры.ОбъектыКУдалению.Добавить(Объект.Ссылка);	
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;


Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход И НЕ ЗначениеЗаполнено(Объект.СчетУчетаРасчетовСКонтрагентом) Тогда
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
КонецЕсли;
//**********************************************************************************************
// Процедура "УстановитьТипКонтрагент()" формы документа
ИмяСправочника         = "Контрагенты";
ИмяРасчетногоДокумента ="РасходныйКассовыйОрдер";
Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
	ИмяСправочника = "БанковскиеСчета";
	//в этом случае счет учета можно заполнить
	ЭтоРублевыйДокумент = Объект.ВалютаДокумента = Параметры.ВалютаРегламентированногоУчета 
		ИЛИ Объект.ВалютаДокумента = Справочники.Валюты.ПустаяСсылка();
	Если ЭтоРублевыйДокумент тогда
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
	Иначе
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
	КонецЕсли;
ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица Тогда
	ИмяСправочника = "ФизическиеЛица";
ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда
	ИмяСправочника = "Склады";
ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда
	// Прочее оприходование денежных средств пока не реализовано.
КонецЕсли;
Если ТипЗнч(Объект.Контрагент) <> Тип("СправочникСсылка." + ИмяСправочника) Тогда
	Объект.Контрагент = Справочники[ИмяСправочника].ПустаяСсылка();
КонецЕсли;


//**********************************************************************************************
Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоКредитамИЗаймам)Тогда
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, СтрокаПлатеж.ДоговорКонтрагента);
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансов;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПКО.РозничнаяВыручка тогда
			Если УчетнаяПолитика.РозничнаяТорговляОблагаетсяЕНВД(Объект.Организация, Объект.Дата) Тогда
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД;
			Иначе
				СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
			КонецЕсли;
		Иначе
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
		КонецЕсли;
	КонецЕсли;
КонецЦикла;

ИмяРеквизита = "СчетКасса";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);

// -- если ПКО на получение денег с расчетного счета, то проводим его через сч. 57 --
Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход;
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПереводыВПути;
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);