Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаРасчетовСКонтрагентом) И Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание Тогда
		
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
КонецЕсли;

Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда

		СтруктураСчетов = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
				Объект.Организация,
				Объект.Контрагент,
				СтрокаПлатеж.ДоговорКонтрагента
		);
			
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
			Если СтрокаПлатеж.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовСКомитентом;
			Иначе
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
			КонецЕсли;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансов;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансовПокупателя;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
		Иначе
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СтруктураСчетов.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СтруктураСчетов.СчетАвансов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецЦикла;

ИмяРеквизита = "СчетБанк";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);

// -- статья ДДС "перемещение д/с" --
Если Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000175" Тогда
	Объект.СчетУчетаРасчетовСКонтрагентом = Объект.СчетБанк;
	Объект.СубконтоДт1 = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", Объект.СчетКонтрагента.НомерСчета, ,Объект.Организация);
	Объект.СубконтоДт2 = Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
КонецЕсли;

// -- снятие наличных по чеку --
Если Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000172" Тогда
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПереводыВПути;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) И Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
	Объект.СтатьяДвиженияДенежныхСредств = Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);