Если Параметры.АвтоЗачетОплаты Тогда
	Отказ = Истина; 	
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
	ИмяПКО = "РасходныйКассовыйОрдер";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
	ИмяПКО = "ПлатежноеПоручениеИсходящее";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств") Тогда
	ИмяПКО = "ПлатежныйОрдерСписаниеДенежныхСредств";
Иначе
	Отказ = Истина;
КонецЕсли;