Если ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	ИмяПКО  = "КорректировкаПоступления";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
	ИмяПКО  = "АвансовыйОтчет";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
	ИмяПКО  = "ВозвратТоваровОтПокупателя";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
	ИмяПКО  = "ПоступлениеДопРасходов";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И ОбъектКоллекции.ДокументОснование.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеИзПереработки Тогда
	ИмяПКО  = "ПоступлениеИзПереработки";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	ИмяПКО  = "ПоступлениеТоваровУслуг";
КонецЕсли;