Документы.РеализацияУслугПоПереработке.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Услуги");
Документы.РеализацияУслугПоПереработке.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "МатериалыЗаказчика");

Для каждого СтрокаТовары Из Объект.Услуги Цикл
	
	СтрокаТовары.СчетУчета = ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья;
	Объект.ЗаполнитьСубконто(СтрокаТовары);
	
КонецЦикла;

Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;

Выполнить(Алгоритмы.ПровестиДокумент);