ТаблицаПоТоварам = Источник.Товары.Выгрузить();
//Запросы.Комплекты.УстановитьПараметр("МассивНоменклатуры", ТаблицаПоТоварам.ВыгрузитьКолонку("Номенклатура"));
//ТабКомплекты = Запросы.Комплекты.Выполнить().Выгрузить();
ТаблицаПоТоварам.Колонки.Добавить("Комплект");
//ТаблицаПоТоварам.Колонки.Удалить("Коэффициент");
//Для каждого СтрокаТовары Из ТаблицаПоТоварам Цикл
//	НайденнаяСтрока = ТабКомплекты.Найти(СтрокаТовары.Номенклатура, "Ссылка");
//	Если НайденнаяСтрока <> Неопределено Тогда
//		СтрокаТовары.Комплект = НайденнаяСтрока.Комплект;
//	КонецЕсли;
//КонецЦикла;
КоллекцияОбъектов = УправлениеЗапасами.СформироватьТаблицуКомплектующих(ТаблицаПоТоварам, Источник);
//КоллекцияОбъектов.Колонки.Добавить("Коэффициент");
Для каждого СтрокаТовары Из КоллекцияОбъектов Цикл
	СтрокаТовары.Коэффициент = СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
	СтрокаТовары.Количество = СтрокаТовары.Количество * СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
	СтрокаТовары.Цена = ?(СтрокаТовары.Количество <> 0, СтрокаТовары.Сумма / СтрокаТовары.Количество, 0);
КонецЦикла;

КоллекцияОбъектов.Колонки.Добавить("Содержание");

Для Каждого СтрокаТЧ Из Источник.Услуги Цикл
    НоваяСтрока = КоллекцияОбъектов.Добавить();
    ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
КонецЦикла;