ТабУслуги = Источник.Услуги.Выгрузить();

Значение = Документы.РеализацияТоваровУслуг.ПустаяСсылка();

ИмяПКО = "РеализацияТоваровУслуг";
Для Каждого текСтрока из ТабУслуги Цикл
	
	Если текСтрока.СчетНДС.Код = "19.07" и ЗначениеЗаполнено(текСтрока.ДокументОтгрузки) Тогда
		Значение = текСтрока.ДокументОтгрузки;
		Если Значение.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.РеализацияОтгруженныхТоваров Тогда
			ИмяПКО = "РеализацияОтгруженныхТоваров";
		КонецЕсли;
		Прервать;
	КонецЕсли;
	
КонецЦикла;