ВЫБРАТЬ
	Док.Ссылка                       КАК ДокументСсылка,
	Док.Ссылка.Номер,
	Док.Ссылка.Дата,
	Док.Ссылка.Комментарий,
	Док.Ссылка.Ответственный,
	Док.Ссылка.НеПроводитьНулевыеЗначения,
	Док.Ссылка.Информация,
	Док.ТипЦен,
	Док.Номенклатура,
	Док.Цена,
	Док.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	Док.Валюта
ИЗ
	Документ.УстановкаЦенНоменклатуры.Товары КАК Док
ГДЕ
	Док.Ссылка.Проведен
	И Док.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	И ((&ДатаОкончания <> Неопределено И Док.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) 
	   ИЛИ (Док.Ссылка.Дата > &ДатаНачала))

ИТОГИ ПО ДокументСсылка, ТипЦен