ВалютаРегламентированногоУчета = Параметры.ВалютаРегламентированногоУчета;
ЭтоРублевыйДокумент = (Объект.ВалютаДокумента = ВалютаРегламентированногоУчета
						ИЛИ НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента));
	
Если ЭтоРублевыйДокумент Тогда
	Если ИмяРеквизита = "СчетБанк" Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
	Иначе
		СчетУчета = ПланыСчетов.Хозрасчетный.КассаОрганизации;
	КонецЕсли;
Иначе
	Если ИмяРеквизита = "СчетБанк" Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
	Иначе
		СчетУчета = ПланыСчетов.Хозрасчетный.КассаОрганизацииВал;
	КонецЕсли;
КонецЕсли;

Объект[ИмяРеквизита] = СчетУчета;

//НастройкаКУДиР = НалоговыйУчетУСН.НастройкаКУДиР(Объект);
//ЗаполнитьЗначенияСвойств(Объект, НастройкаКУДиР);