// 1СTeam Томилин А.П. 25.10.2022 [T1C-2645] НАЧАЛО
Если Параметры.Свойство("КодУзлаОтладки") И ЗначениеЗаполнено(Параметры.КодУзлаОтладки) Тогда
	УзелДляОбмена = ПланыОбмена.ОбменУправлениеТорговлей103БухгалтерияПредприятия30.НайтиПоКоду(Параметры.КодУзлаОтладки);
КонецЕсли;
// 1СTeam Томилин А.П. 25.10.2022 [T1C-2645] КОНЕЦ
Если УзелДляОбмена.ВариантПереносаСебестоимостиСписанияВБухгалтериюПредприятия <> Перечисления.ВариантыПереносаСебестоимостиСписанияВБухгалтериюПредприятия.ПереноситьДокументПартииИСебестоимость Тогда
	Отказ = Истина;
КонецЕсли