Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаРасчетовСКонтрагентом) И Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание Тогда
	
	Если Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000139" ИЛИ Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000201" // Статья ДДС - "РКО" или "Валютные переводы"
		ИЛИ Найти(Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Наименование, "омиссия") > 0 Тогда 
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
		Объект.СубконтоДт1 = ПараметрыОбъекта.Получить("СтатьяЗатрат");		
	Иначе			
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
	КонецЕсли;	
	
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) И Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
	Объект.СтатьяДвиженияДенежныхСредств = Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
КонецЕсли;	
	
Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда

		СтруктураСчетов = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
				Объект.Организация,
				Объект.Контрагент,
				СтрокаПлатеж.ДоговорКонтрагента
		);
			
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
			Если СтрокаПлатеж.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовСКомитентом;
			Иначе
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
			КонецЕсли;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансов;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансовПокупателя;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
		Иначе
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СтруктураСчетов.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СтруктураСчетов.СчетАвансов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецЦикла;

ИмяРеквизита = "СчетБанк";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);
Выполнить(Алгоритмы.ПровестиДокумент);