ТаблицаТоваров = Источник.Товары.Выгрузить();
ТаблицаТоваров.Свернуть("ДокументПартии");
Если ТаблицаТоваров.Количество() > 1 Тогда  
	Пусто = Истина; 
	КомментарийПриВыгрузкеДанных = КомментарийПриВыгрузкеДанных + Символы.ПС +
	"Документ " + Источник + " имеет более одного документа поступления!" + Символы.ПС + "Документ поступления не выгружен.";

ИначеЕсли ТаблицаТоваров.Количество() = 0 Тогда 
	 Пусто = Истина; 
Иначе     	 
	 Значение = ТаблицаТоваров[0].ДокументПартии;
	 Если ТипЗнч(Значение) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда  
		 ИмяПКО = "ОтчетОРозничныхПродажах"; 
	 КонецЕсли;   
КонецЕсли;