 ВЫБРАТЬ
	Партии.Номенклатура,
	Партии.ХарактеристикаНоменклатуры,
	Партии.СерияНоменклатуры,
	ВЫБОР
		КОГДА Партии.ВидДвижения = &Расход
			ТОГДА Партии.Количество * Партии.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
		ИНАЧЕ -(Партии.Количество * Партии.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент)
	КОНЕЦ КАК Количество,
	Партии.СтатусПартии,
	Партии.ДокументОприходования,
	ВЫБОР
		КОГДА Партии.ВидДвижения = &Расход
			ТОГДА Партии.Стоимость + ЕСТЬNULL(ПартииКор.Стоимость, 0)
		ИНАЧЕ -(Партии.Стоимость + ЕСТЬNULL(ПартииКор.Стоимость, 0))
	КОНЕЦ КАК Стоимость
ИЗ
	РегистрНакопления.ПартииТоваровНаСкладах КАК Партии
		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			ПартииТоваровНаСкладах.НомерСтроки КАК НомерСтроки,
			СУММА(ПартииТоваровНаСкладах.Стоимость) КАК Стоимость
		ИЗ
			РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
		ГДЕ
			ПартииТоваровНаСкладах.ДокументДвижения = &ДокументСсылка
		
		СГРУППИРОВАТЬ ПО
			ПартииТоваровНаСкладах.НомерСтроки) КАК ПартииКор
		ПО Партии.НомерСтроки = ПартииКор.НомерСтроки
ГДЕ
	Партии.Регистратор = &ДокументСсылка