Документы.ПередачаМатериаловВЭксплуатацию.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ИнвентарьИХозяйственныеПринадлежности");	

ПараметрыИнвентарьИХозяйственныеПринадлежности = ПараметрыОбъекта["ИнвентарьИХозяйственныеПринадлежностиТабличнаяЧасть"];

Для Каждого СтрокаТЗ Из Объект.ИнвентарьИХозяйственныеПринадлежности Цикл
	
	НайденнаяСтрока = ПараметрыИнвентарьИХозяйственныеПринадлежности[Объект.ИнвентарьИХозяйственныеПринадлежности.Индекс(СтрокаТЗ)];
	
	Выполнить(Алгоритмы.ЗаполнитьСпособОтраженияРасходов);
	
КонецЦикла;

Выполнить(Алгоритмы.ПровестиДокумент);

Выполнить(Алгоритмы.УдалитьСвязанныйДокументТН);