Если Параметры.АвтоЗачетОплаты Тогда
	Значение = "Автоматически";
ИначеЕсли Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДопРасходов.ВнутреннийРасход Тогда
	Значение = "НеЗачитывать";
Иначе
	Если Источник.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
		ТипДокументаРасчетов = "ПоступлениеДопРасходов";
		КоллекцияОбъектов = Источник.ДокументыРасчетовСКонтрагентом.Выгрузить();
		Выполнить(Алгоритмы.УдалитьСтрокиИзТабСНекоректнымТипомДокументовРасче);
		Если КоллекцияОбъектов.Количество() > 0 Тогда
			Значение = "ПоДокументу";
		Иначе
			Значение = "НеЗачитывать";
		КонецЕсли;
	Иначе
		Значение = "Автоматически";
	КонецЕсли;
КонецЕсли;