// ---- Процедура формы элемента ПриИзмененииВидаКонтактногоЛица()
Если НЕ ЗначениеЗаполнено(Объект.ВидКонтактногоЛица) Тогда
	Объект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;

КонецЕсли;
Если Объект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента Тогда
	Если ТипЗнч(Объект.ОбъектВладелец) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Объект.ОбъектВладелец = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
ИначеЕсли Объект.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт Тогда
	Если Объект.ОбъектВладелец <> глЗначениеПеременной("глТекущийПользователь") Тогда
		Объект.ОбъектВладелец = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
Иначе
	Если ТипЗнч(Объект.ОбъектВладелец) <> Тип("СправочникСсылка.Пользователи") Тогда
		Объект.ОбъектВладелец = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецЕсли;
// ----