// Алгоритм очищает некорректные документы расчетов в табличной части "Расшифровка платежа" в платежных документах.
// Документ расчетов считается некорректным, если тип в УТ документа расчета не соответствует типу в БП для расчетного документа.
// Перечень несоответствующих типов определен в событии конвертации "Перед выгрузкой данных".
// в массиве МассивНекорректныхТиповДокументовРасчетов содержаться не корректные типы.
// Так же удаляет документы расчетов по договору с комитентом (документы расчетов с комитентом не выгружаются, т.к. образование расчетных документов в УТ и БП КОРП различные)
// В УТ задолженность по документу расчетов образовывает "Отчет комитенту о продаже товаров" сам же и является документом расчетов,
// в БП это документ "Реализация товаров и услуг" и в качестве документа расчетов устанавливается поступление товаров.

МассивНекорректныхТиповДокументовРасчетов = Неопределено;
Если Параметры.СтруктураНевыгружаемыхДокументовРасчетов.Свойство(ТипДокументаРасчетов, МассивНекорректныхТиповДокументовРасчетов) Тогда
	Для Каждого СтрокаСодежащаяДокументРасчета Из КоллекцияОбъектов Цикл
		Если МассивНекорректныхТиповДокументовРасчетов.Найти(ТипЗнч(СтрокаСодежащаяДокументРасчета.ДокументРасчетовСКонтрагентом)) <> Неопределено
			ИЛИ СтрокаСодежащаяДокументРасчета.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаСодежащаяДокументРасчета.ДокументРасчетовСКонтрагентом = Неопределено;
		КонецЕсли;
	КонецЦикла;
КонецЕсли;