Если НЕ (Источник.ВидОперации = Перечисления.кси_ВидыОперацийДокументаВнутреннееОборудование.ПринятиеНаУчет 
	Или Источник.ВидОперации = Перечисления.кси_ВидыОперацийДокументаВнутреннееОборудование.ПеремещениеОборудования
	Или Источник.ВидОперации = Перечисления.кси_ВидыОперацийДокументаВнутреннееОборудование.СписаниеСУчета) Тогда
	
	ВыгрузитьПоПравилу(Источник,,,,"ВнутреннееОборудованиеВТребованиеНакладная");	
	
	Отказ = Истина;
	
Иначе
	
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);

	Выполнить(Алгоритмы.МожноВыгружатьДокументПоОрганизацииСкладов);

КонецЕсли