ВыгрузитьВБП = ПараметрыОбъекта.Получить("ВыгрузитьВБП");

Если (Объект.Ссылка.Пустая() И НЕ ВыгрузитьВБП) Или (ДатыЗапретаИзменения.ИзменениеЗапрещено(Объект, , Ложь) Или Объект.Ссылка.РучнаяКорректировка) Тогда
	
	Отказ = Истина; 
	
Иначе
	
	Объект.Товары.Свернуть("Номенклатура, ЕдиницаИзмерения, Коэффициент, Цена, СчетУчета, НовыйСчетУчета, ЦенаВРознице, СтавкаНДСВРознице, ДокументОприходования, СпособУчетаНДС", "Количество, СуммаВРознице, Себестоимость");
	
	Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
	
	Если Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость тогда
		Документы.ПеремещениеТоваров.ЗаполнитьСчетаСписанияНДСЗначениямиПоУмолчанию(Объект);
	КонецЕслИ;
	
	Выполнить(Алгоритмы.ПровестиДокумент);
	
	Выполнить(Алгоритмы.УдалитьСвязанныйДокументПеремещениеТоваров); 
	
КонецЕсли;