// Алгоритм удаляет не корректные строки из табличной части "Предоплата" в товарных документах.
// Строка считается не корректной, если тип в УТ документа предоплаты не соответствует типу в БП для документа аванса.
// Перечень несоответствующих типов определен в событии конвертации "Перед выгрузкой данных".
// в массиве МассивНекорректныхТиповДокументовРасчетов содержаться не корректные типы.

итератор = 0;
МассивНекорректныхТиповДокументовРасчетов = Неопределено;
Если Параметры.СтруктураНевыгружаемыхДокументовРасчетов.Свойство(ТипДокументаРасчетов, МассивНекорректныхТиповДокументовРасчетов) Тогда
	Пока итератор <= КоллекцияОбъектов.Количество() - 1 Цикл
		СтрокаСодежащаяДокументРасчета = КоллекцияОбъектов.Получить(итератор);
		Если МассивНекорректныхТиповДокументовРасчетов.Найти(ТипЗнч(СтрокаСодежащаяДокументРасчета.ДокументРасчетовСКонтрагентом)) <> Неопределено Тогда
			КоллекцияОбъектов.Удалить(итератор);
		Иначе
			итератор = итератор + 1;
		КонецЕсли;
	КонецЦикла;
КонецЕсли;