Если Параметры.АвтоЗачетОплаты Тогда
	Отказ = Истина; 	
ИначеЕсли ОбъектКоллекции.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом И ЗначениеЗаполнено(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) Тогда
	Отказ = Ложь;
	Если ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		и Найти(ОбъектКоллекции.ДокументРасчетовСКонтрагентом.Комментарий, "Загружено из MSSQL") = 0 Тогда
		ИмяПКО = ?(ОбъектКоллекции.ДокументРасчетовСКонтрагентом.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.РеализацияОтгруженныхТоваров, "РеализацияОтгруженныхТоваров", "РеализацияТоваровУслуг");
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		и Найти(ОбъектКоллекции.ДокументРасчетовСКонтрагентом.Комментарий, "Загружено из MSSQL") > 0 Тогда
		//ИмяПКО = "РеализацияТоваровУслуг";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеВходящее";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		ИмяПКО = "КорректировкаДолга";
	КонецЕсли;	
Иначе
	Отказ = Истина;
КонецЕсли;