ТаблицаХозрасчетный = Объект.Движения.Хозрасчетный;
ТаблицаХозрасчетный.Очистить();
СуммаОперации = 0;
Если ПараметрыОбъекта <> Неопределено тогда
    ТаблицаПараметров = ПараметрыОбъекта["ЗаполнениеДвиженийТабличнаяЧасть"]; 	
	Для Каждого СтрокаПараметров Из ТаблицаПараметров Цикл

		Проводка   = ТаблицаХозрасчетный.Добавить();
		Проводка.Период = Объект.Дата;
		ЗаполнитьЗначенияСвойств(Проводка, СтрокаПараметров);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаПараметров.Номенклатура);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", ПараметрыОбъекта["Контрагент"]);
	    СуммаОперации = СуммаОперации + Проводка.Сумма;
	КонецЦикла;

	Проводка   = ТаблицаХозрасчетный.Добавить();
	Проводка.Период = Объект.Дата;
	Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение;
	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", ПараметрыОбъекта["Комплект"]);
	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Контрагенты", ПараметрыОбъекта["Контрагент"]);
	Проводка.КоличествоДт = ПараметрыОбъекта["Количество"];
	Проводка.Сумма = СуммаОперации;
КонецЕсли; 
Объект.СуммаОперации = СуммаОперации * 2;
Объект.ЗаполнениеДвижений.Очистить();