
СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
	Объект.Организация,
	Объект.Контрагент,
	Объект.ДоговорКонтрагента
);
Объект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетов;
Объект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансов;


Для каждого СтрокаТЧ Из Объект.Товары Цикл
	СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	
	мСчетНДС =  СтрокаТЧ.СчетУчетаНДС;
	
	Документы.ПоступлениеДопРасходов.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(Объект, СтрокаТЧ, "Товары");
	
	Если ЗначениеЗаполнено(мСчетНДС) Тогда
		СтрокаТЧ.СчетУчетаНДС = мСчетНДС;	
	КонецЕсли;

	
КонецЦикла;


Выполнить(Алгоритмы.ПровестиДокумент);