Если ТипЗнч(мСклад) = Тип("СправочникСсылка.Склады") Тогда
	//Заполненный  реквизит склад БУ имеет приоритет
	Значение = ?(ЗначениеЗаполнено(мСклад.СкладБУ), мСклад.СкладБУ, мСклад);

	//Проверяем организацию выгружаемого склада, если не равна организации из шапки документа то ищем подмену для связи "Организация из документа" и "организация склада"
	СрезПоследних = РегистрыСведений.ОрганизацииСкладов.СрезПоследних(Источник.Дата, Новый Структура("Склад", Значение));  
	Если СрезПоследних.Количество() > 0 И  СрезПоследних[0].Организация <> Параметры.ОрганизацияВыгрузки Тогда
		СрезСкладовПодмены = РегистрыСведений.ПодменыПриОбмене.СрезПоследних(Источник.Дата, Новый Структура("ОрганизацияВыгрузки, ДополнительныйРезвизит", Параметры.ОрганизацияВыгрузки, СрезПоследних[0].Организация));
		Значение = ?(СрезСкладовПодмены.Количество() > 0, СрезСкладовПодмены[0].Подмена, Значение); 			
	КонецЕсли;

	//Проверяем не настроена ли дополнительная подмена для самого склада 
	СрезСкладовПодмены = РегистрыСведений.ПодменыПриОбмене.СрезПоследних(Источник.Дата, Новый Структура("ОрганизацияВыгрузки, ДополнительныйРезвизит", Параметры.ОрганизацияВыгрузки, Значение));
	Значение = ?(СрезСкладовПодмены.Количество() > 0, СрезСкладовПодмены[0].Подмена, Значение);
КонецЕсли;