Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку;
ЕстьНалоговыйУчетУСН = УчетнаяПолитика.ПрименяетсяУСН(Объект.Организация, Объект.Дата);

Если ЕстьНалоговыйУчетУСН Тогда
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		Иначе
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	
КонецЕсли;

СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаРасчетов(Объект);

Для каждого СтрокаТЧ из Объект.Товары Цикл 	
	
	мСчетНДС =  СтрокаТЧ.СчетУчетаНДС;
	
	СтрокаТЧ.СчетУчета           = ПланыСчетов.Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение;
	
	Если ЗначениеЗаполнено(мСчетНДС) Тогда
		СтрокаТЧ.СчетУчетаНДС = мСчетНДС;	
	КонецЕсли;	
	
КонецЦикла;

Объект.Дата = КонецДня(Объект.Дата);

Выполнить(Алгоритмы.ПровестиДокумент);