ВЫБРАТЬ
	ОтчетКомиссионераОПродажахТовары.НомерСтроки,
	ОтчетКомиссионераОПродажахТовары.Номенклатура,
	ОтчетКомиссионераОПродажахТовары.КоличествоМест,
	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения,
	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмеренияМест,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.Коэффициент КАК ЧИСЛО(16, 6)) КАК Коэффициент,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.Количество КАК ЧИСЛО(21, 6)) КАК Количество,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.Цена КАК ЧИСЛО(17, 4)) КАК Цена,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.Сумма КАК ЧИСЛО(17, 4)) КАК Сумма,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения КАК ЧИСЛО(17, 4)) КАК СуммаВознаграждения,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения КАК ЧИСЛО(17, 4)) КАК СуммаНДСВознаграждения,
	ОтчетКомиссионераОПродажахТовары.СтавкаНДС,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК ЧИСЛО(17, 4)) КАК СуммаНДС,
	ОтчетКомиссионераОПродажахТовары.ХарактеристикаНоменклатуры,
	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.ЦенаПередачи КАК ЧИСЛО(17, 4)) КАК ЦенаПередачи,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.СуммаПередачи КАК ЧИСЛО(17, 4)) КАК СуммаПередачи,
	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажахТовары.СуммаНДСПередачи КАК ЧИСЛО(17, 4)) КАК СуммаНДСПередачи,
	ОтчетКомиссионераОПродажахТовары.КлючСвязи
ИЗ
	Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
ГДЕ
	ОтчетКомиссионераОПродажахТовары.Ссылка = &ДокументСсылка