// -- создаем проводки на сумму --
Объект.Содержание = "Комиссия банка за покупку валюты (" + ПараметрыОбъекта.Получить("Контрагент") + " - " + ПараметрыОбъекта.Получить("ВалютаДокумента") + ")";
Проводки = Объект.Движения.Хозрасчетный;
Проводка = Проводки.Добавить();
Проводка.Период       	= Объект.Дата;
Проводка.Содержание   	= "Комиссия банка за покупку валюты";
Проводка.Организация  	= Объект.Организация;
Проводка.Сумма        	= Объект.СуммаОперации;

Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("00005"));

Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПараметрыОбъекта.Получить("Контрагент"));
БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, ПараметрыОбъекта.Получить("ДоговорКонтрагента"));

// -- налоговый учет --
Если Проводка.СчетДт.НалоговыйУчет Тогда
	Проводка.СуммаНУДт = Объект.СуммаОперации;
КонецЕсли;

Если Проводка.СчетКт.НалоговыйУчет Тогда
	Проводка.СуммаНУКт = Объект.СуммаОперации;
КонецЕсли;