Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Для каждого Стр из Объект.ДебиторскаяЗадолженность Цикл
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.КонтрагентДебитор, Стр.ДоговорКонтрагента);
	Если Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетАвансов;
	ИначеЕсли Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетРасчетовПокупателя;
	ИначеЕсли Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда	
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетРасчетов;
	КонецЕсли;
КонецЦикла;

Для каждого Стр из Объект.КредиторскаяЗадолженность Цикл
	 СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.КонтрагентКредитор, Стр.ДоговорКонтрагента);
	 Если Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетРасчетов;
	ИначеЕсли Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетАвансовПокупателя;
	ИначеЕсли Стр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда	
		Стр.СчетУчетаРасчетов = СчетаУчета.СчетРасчетов;
	КонецЕсли;
КонецЦикла;

Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.КонтрагентКредитор, Объект.ДоговорКонтрагента);
	
	Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		Объект.СчетДт = СчетаУчета.СчетРасчетов;
		Объект.СчетКт = СчетаУчета.СчетАвансов;
	ИначеЕсли Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
		Тогда
		Объект.СчетДт = СчетаУчета.СчетАвансовПокупателя;
		Объект.СчетКт = СчетаУчета.СчетРасчетовПокупателя;
	ИначеЕсли Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		Объект.СчетДт = СчетаУчета.СчетРасчетовСКомитентом;
		Объект.СчетКт = СчетаУчета.СчетРасчетовСКомитентом;
	КонецЕсли;
	
КонецЕсли;

Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("Сумма");
Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("Сумма");

Выполнить(Алгоритмы.ПровестиДокумент);