Если ОбъектКоллекции.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом И ЗначениеЗаполнено(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) Тогда
	Отказ = Ложь;	
	Если ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ИмяПКО = "РеализацияТоваровУслуг";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеВходящее";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ИмяПКО = "ПоступлениеТоваровУслуг";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеИсходящее";
	Иначе
		Отказ = Истина;
	КонецЕсли;
Иначе
	Отказ = Истина;
КонецЕсли;