Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

// 1СTeam Калмыков П.Н. 23.08.2024 [T1C-3709] НАЧАЛО
Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
	Если ЗначениеЗаполнено(ПараметрыОбъекта["ПараметрВидОперации"]) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийРасходМатериалов[ПараметрыОбъекта["ПараметрВидОперации"]];
	КонецЕсли;
КонецЕсли;
// 1СTeam Калмыков П.Н. 23.08.2024 [T1C-3709] КОНЕЦ

Объект.СчетаУчетаЗатратВТаблице  = Истина;  
ЕстьПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Объект.Организация, Объект.Дата);

ТаблицаДляСчетов = Объект.Материалы.Выгрузить();
// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] НАЧАЛО
ТаблицаДляСчетов.Колонки.Добавить("СтатьяЗатрат"); 
ТаблицаДляСчетов.Колонки.Добавить("НоменклатурнаяГруппа");
ПараметрыТЧматериалы = ПараметрыОбъекта["МатериалыТабличнаяЧасть"];
// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] КОНЕЦ

Документы.ТребованиеНакладная.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Материалы"); 

// 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486] НАЧАЛО
ЭтоГарантийныеСтатьи = Истина;  
СтатьиГарантии = кси_РаботаСВнешнимиСервисами.ПолучитьЗначениеНастройки("НастройкиГарантийныхТН", "ГарантийнаяСтатья", Истина); 
ЭтоГарантийныеСчета = Истина; 
СчетГарантии = ПланыСчетов.Хозрасчетный.ИздержкиОбращения; //44.01
// 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486] КОНЕЦ

Для Каждого СтрСчет Из ТаблицаДляСчетов Цикл
	// 1СTeam Фасхетдинов Д.М. 17.11.2023 [T1C-3173] НАЧАЛО
	СтруктураПараметров = Новый Структура("СтатьяЗатрат,НоменклатурнаяГруппа");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1]);
	// 1СTeam Фасхетдинов Д.М. 17.11.2023 [T1C-3173] КОНЕЦ
	// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] НАЧАЛО
	СтрСчет.СтатьяЗатрат = СтруктураПараметров.СтатьяЗатрат; // Было ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1].СтатьяЗатрат; // 1СTeam Томилин А.П. 29.09.2023 [T1C-3173] КОНЕЦ
	СтрСчет.НоменклатурнаяГруппа = СтруктураПараметров.НоменклатурнаяГруппа; // Было ПараметрыТЧматериалы[СтрСчет.НомерСтроки-1].НоменклатурнаяГруппа; // 1СTeam Томилин А.П. 29.09.2023 [T1C-3173] КОНЕЦ
	Если Не ЗначениеЗаполнено(СтрСчет.НоменклатурнаяГруппа) Тогда
		СтрСчет.НоменклатурнаяГруппа = СтрСчет.Номенклатура.НоменклатурнаяГруппа;
	КонецЕсли;
	// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] КОНЕЦ  
	
	ЭтоГарантийныеСтатьи = ?(СтатьиГарантии.Найти(СтрСчет.СтатьяЗатрат) = Неопределено, Ложь, ЭтоГарантийныеСтатьи);  // 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486]
	
    НайденаяСтрока = Объект.Материалы.Найти(СтрСчет.НомерСтроки,"НомерСтроки");
    Если НайденаяСтрока <> Неопределено Тогда
        НайденаяСтрока.СчетЗатрат     = СтрСчет.СчетЗатрат; 
		
		ЭтоГарантийныеСчета = ?(ЭтоГарантийныеСчета И СчетГарантии <> НайденаяСтрока.СчетЗатрат, Ложь, ЭтоГарантийныеСчета);   // 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486]
		
		// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] НАЧАЛО
    	//НайденаяСтрока.СтатьяЗатрат   = СтрСчет.СтатьяЗатрат; 
		ЧислоАктивныхСубконто = НайденаяСтрока.СчетЗатрат.ВидыСубконто.Количество();
		Для Сч = 1 По ЧислоАктивныхСубконто Цикл
			
			Если НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				НайденаяСтрока["Субконто" + Сч] = СтрСчет.СтатьяЗатрат;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
				НайденаяСтрока["Субконто" + Сч] = СтрСчет.НоменклатурнаяГруппа;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
				НайденаяСтрока["Субконто" + Сч] = Объект.ПодразделениеОрганизации;
			ИначеЕсли НайденаяСтрока.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
				НайденаяСтрока["Субконто" + Сч] = ПараметрыОбъекта["НоменклатураГотовойПродукции"]; 			
			КонецЕсли;
			
		КонецЦикла;	
		// 1СTeam Томилин А.П. 29.09.2023 [T1C-3132] КОНЕЦ
	
    КонецЕсли;
КонецЦикла; 

// 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486] НАЧАЛО
Если ЭтоГарантийныеСчета И ЭтоГарантийныеСтатьи И Объект.ВидОперации = Перечисления.ВидыОперацийРасходМатериалов.ИспользованиеМатериалов Тогда 
	Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость;
	Объект.ДляСписанияНДСиспользоватьСчетИАналитикуУчетаЗатрат = 0;
	Объект.СчетСписанияНДС = ПланыСчетов.Хозрасчетный.ПрочиеРасходы; 
	Объект.СубконтоСписанияНДС1 = кси_РаботаСВнешнимиСервисами.ПолучитьЗначениеНастройки("НастройкиГарантийныхТН", "НДС_кВосстановлению");;
Иначе
	//Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
	Объект.ДляСписанияНДСиспользоватьСчетИАналитикуУчетаЗатрат = 0; 
	Объект.СчетСписанияНДС = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	Объект.СубконтоСписанияНДС1 = Неопределено;
КонецЕсли; 
// 1СTeam Калмыков П.Н. 24.05.2024 [T1C-3486] КОНЕЦ

Для каждого СтрокаТабличнойЧасти Из Объект.Материалы Цикл
	//Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.НоменклатурнаяГруппа) Тогда //Закомментировали // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
	//	СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппа; // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
	//КонецЕсли; // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
	
	Если ЕстьПрименениеУСН тогда
		СтрокаТабличнойЧасти.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЕсли;	
	
	Если СтрокаТабличнойЧасти.СчетЗатрат.УчетПоПодразделениям Тогда
		СтрокаТабличнойЧасти.ПодразделениеЗатрат = Объект.ПодразделениеЗатрат;
    КонецЕсли;
КонецЦикла;

Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	Объект.Склад = Параметры.СкладДляОбменаДаннымиСУТ;
КонецЕсли;

// -- обработка счета затрат по БУ и НУ (если указан один и тот же счет затрат) --
Таблица = ТаблицаДляСчетов.Скопировать(); // Было Объект.Материалы.Выгрузить(); // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
Таблица.Свернуть("СчетЗатрат, СтатьяЗатрат", "");

Если Таблица.Количество() = 1 Тогда
	
	Объект.СчетаУчетаЗатратВТаблице = Ложь; 	
	Объект.СчетЗатрат = ТаблицаДляСчетов[0].СчетЗатрат; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]	
	ЧислоАктивныхСубконто = Объект.СчетЗатрат.ВидыСубконто.Количество();

	Для Сч = 1 По ЧислоАктивныхСубконто Цикл
		Если Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
			Объект["Субконто" + Сч] = ТаблицаДляСчетов[0].СтатьяЗатрат; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
			Объект["Субконто" + Сч] = ТаблицаДляСчетов[0].НоменклатурнаяГруппа; //Было Объект.Материалы[0] // 1СTeam Томилин А.П. 29.09.2023 [T1C-3132]
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
			Объект["Субконто" + Сч] = Объект.ПодразделениеОрганизации;
		ИначеЕсли Объект.СчетЗатрат.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
			Объект["Субконто" + Сч] = ПараметрыОбъекта["НоменклатураГотовойПродукции"]; 			
		КонецЕсли;
	КонецЦикла;  

КонецЕсли;

Для каждого СтрокаТабличнойЧасти Из Объект.МатериалыЗаказчика Цикл
	СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТабличнойЧасти.Номенклатура, Объект.Склад);	
	СтрокаТабличнойЧасти.Счет = СчетаУчета.СчетУчетаДавСырья;
	СтрокаТабличнойЧасти.СчетПередачи = СчетаУчета.СчетПередачиЗаб;
КонецЦикла;

Выполнить(Алгоритмы.ПровестиДокумент);     

Выполнить(Алгоритмы.УдалитьСвязанныйДокументТН);