Параметры.АвтоЗачетОплаты = ЗначениеЗаполнено(Параметры.СобственныеКонтрагенты.Найти(Источник.Контрагент,"Контрагент"));

Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтветственноеХранение Тогда
	// -- создаем документ "Поступления с видом операции "ВПереработку"" --
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ПоступлениеТоваровУслугВПереработку");
КонецЕсли;

Если Источник.Комментарий = "Сформировано обработкой переноса остатков" Тогда
	// документы, сформированнные для заведения остатков
Иначе
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);
КонецЕсли;

Если Найти(Источник.Комментарий, "Загружено из MSSQL") > 0 или Найти(Источник.Комментарий, "(не выгружать в БП)") > 0 Тогда
	Отказ = Истина;
КонецЕсли;

Если Не Отказ и Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеИзПереработки Тогда
	
	// -- создаем документ "Поступление из переработки" --
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ПоступлениеИзПереработки");
	
КонецЕсли;

Если ТипЗнч(Источник) <> Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И ТипЗнч(Источник) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	Отказ = Истина;	
КонецЕсли;

// 1СTeam Томилин А.П. 29.12.2023 [T1C-3217] НАЧАЛО
// Было перенесно https://crystals.atlassian.net/browse/T1C-3217?focusedCommentId=247995
// 1СTeam Томилин А.П. 29.12.2023 [T1C-3217] КОНЕЦ