Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
	И Объект.ВозвратнаяТара.Количество() = 0 Тогда
	
	Если Объект.Услуги.Количество() = 0 Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары;
	ИначеЕсли Объект.Товары.Количество() = 0 Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги;
	КонецЕсли;
	
КонецЕсли;

//склад и организация по умолчанию
ЕстьНалоговыйУчетУСН = УчетнаяПолитика.ПрименяетсяУСН(Объект.Организация, Объект.Дата);

Если ЕстьНалоговыйУчетУСН Тогда
	
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		Иначе
			СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	КонецЦикла;
	
КонецЕсли;

Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Объект);
Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ВозвратнаяТара");				

// 1СTeam Еремкин И.А. 20.07.2021 [T1C-2107] НАЧАЛО 
//СчетУчетаПоМалоценномуОборудованию = ПланыСчетов.Хозрасчетный.ПриобретениеМалоценногоОборудованияИЗапасов;

//Если НЕ ОбъектНайден Тогда
//	
//	СсылкаДокумента = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор);
//	
//	Объект.УстановитьСсылкуНового(СсылкаДокумента);
//	
//Иначе
//	
//	СсылкаДокумента = Ссылка;
//	
//КонецЕсли;
// 1СTeam Еремкин И.А. 20.07.2021 [T1C-2107] КОНЕЦ

Для каждого СтрокаТЧ из Объект.Товары Цикл 	
	
	мСчетНДС =  СтрокаТЧ.СчетУчетаНДС;
	
	Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(Объект, СтрокаТЧ, "Товары");
	
	Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		СтрокаТЧ.СчетУчета = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мСчетНДС) Тогда
		СтрокаТЧ.СчетУчетаНДС = мСчетНДС;	
	КонецЕсли;	
	
	// 1СTeam Еремкин И.А. 20.07.2021 [T1C-2107] НАЧАЛО 
	//Если СтрокаТЧ.Номенклатура.ВидНоменклатуры.Наименование = "Малоценное оборудование и запасы" 
	//	И НЕ СтрокаТЧ.СчетУчета = СчетУчетаПоМалоценномуОборудованию Тогда
	//	
	//	СтрокаТЧ.СчетУчета 	= СчетУчетаПоМалоценномуОборудованию;
	//	СтрокаТЧ.СчетЗатрат = СчетУчетаПоМалоценномуОборудованию;
	//	СтрокаТЧ.Субконто1 	= СтрокаТЧ.Номенклатура;
	//	СтрокаТЧ.Субконто2 	= СсылкаДокумента;
	//	СтрокаТЧ.Субконто3 	= Объект.Склад;
	//	
	//КонецЕсли;
	// 1СTeam Еремкин И.А. 20.07.2021 [T1C-2107] КОНЕЦ
	
КонецЦикла;

Для каждого СтрокаТЧ Из Объект.Услуги Цикл
	СтатьяЗатрат      	= СтрокаТЧ.Субконто1;
	Если СтатьяЗатрат 	= Справочники.СтатьиЗатрат.НайтиПоКоду("00052") Тогда
		СтатьяЗатрат 	= Справочники.СтатьиЗатрат.НайтиПоКоду("000000020");
	КонецЕсли;	
	НоменклатурнаяГруппа = СтрокаТЧ.Субконто2;
	Подразделение        = СтрокаТЧ.Субконто3;
	Билет = "";
	ФизическоеЛицо = "";
	ВидРасчетовСПерсоналом = "";
	
	Если ЗначениеЗаполнено(СтатьяЗатрат) и СтатьяЗатрат.Наименование = "Билеты" и СтрокаТЧ.Номенклатура <> ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","КоммуникационныйСбор") Тогда //СтрокаТЧ.Номенклатура.Код <> "00000005248" Тогда
		Если ТипЗнч(СтрокаТЧ.Субконто2) = Тип("СправочникСсылка.Номенклатура") Тогда
			Билет = СтрокаТЧ.Субконто2;
		Иначе
			ФизическоеЛицо = СтрокаТЧ.Субконто2;
		КонецЕсли;
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.ДенежныеДокументы;
		СтрокаТЧ.СчетЗатратНУ = ПланыСчетов.Хозрасчетный.ДенежныеДокументы;  		
	// -- мобильная связь (не приним) --
	ИначеЕсли ЗначениеЗаполнено(СтатьяЗатрат) и СтатьяЗатрат = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СтатьяМобильнаяСвязьНеПрин") и ЗначениеЗаполнено(СтрокаТЧ.Субконто2) Тогда
		
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		СтрокаТЧ.СчетЗатратНУ = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		ФизическоеЛицо = СтрокаТЧ.Субконто2;
		ВидРасчетовСПерсоналом = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СубконтоМобильнаяСвязь");
		
	ИначеЕсли ЗначениеЗаполнено(СтатьяЗатрат) и СтатьяЗатрат = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","ШтрафыГИБДД") и ЗначениеЗаполнено(СтрокаТЧ.Субконто2) Тогда
		
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		СтрокаТЧ.СчетЗатратНУ = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		ФизическоеЛицо = СтрокаТЧ.Субконто2;
		ВидРасчетовСПерсоналом = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СубконтоШтрафыГИБДД");
		
	ИначеЕсли ЗначениеЗаполнено(СтатьяЗатрат) и СтатьяЗатрат = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СтатьяТакси") и ЗначениеЗаполнено(СтрокаТЧ.Субконто2) Тогда
		
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		СтрокаТЧ.СчетЗатратНУ = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		ФизическоеЛицо = СтрокаТЧ.Субконто2;
		ВидРасчетовСПерсоналом = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СубконтоТакси");	
		
	ИначеЕсли ЗначениеЗаполнено(СтатьяЗатрат) и СтатьяЗатрат = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СтатьяТаксиНеПринимаемая") и ЗначениеЗаполнено(СтрокаТЧ.Субконто2) и ТипЗнч(СтрокаТЧ.Субконто2) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		СтрокаТЧ.СчетЗатратНУ = ПланыСчетов.Хозрасчетный.РасчетыПоПрочимОперациям;
		ФизическоеЛицо = СтрокаТЧ.Субконто2;
		ВидРасчетовСПерсоналом = ксОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НастройкиОбменаДанными_УТ_БП","СубконтоТакси");
		
	КонецЕсли;
	
	СтрокаТЧ.Субконто1 = Неопределено;
	СтрокаТЧ.Субконто2 = Неопределено;
	СтрокаТЧ.Субконто3 = Неопределено;
	
	Если Не ЗначениеЗаполнено(СтрокаТЧ.СчетУчетаНДС) Тогда
		СтрокаТЧ.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымУслугам;
	КонецЕсли;
	
	//Объект.ЗаполнитьСчетаУчетаВСтрокеТабЧастиРегл(СтрокаТЧ, "Услуги", Истина, Истина);
	Если ЗначениеЗаполнено(СтрокаТЧ.СчетЗатрат) Тогда
		
		Счет = СтрокаТЧ.СчетЗатрат;  
		Если Счет.УчетПоПодразделениям Тогда
			   СтрокаТЧ.ПодразделениеЗатрат = Подразделение;
		КонецЕсли;	   
		ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
		
		Для Сч = 1 По ЧислоАктивныхСубконто Цикл
			
			Если Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы Тогда
				СтрокаТЧ["Субконто"+Сч] = СтатьяЗатрат;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				СтрокаТЧ["Субконто"+Сч] = СтатьяЗатрат;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
				СтрокаТЧ["Субконто"+Сч] = Объект.Контрагент;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
				СтрокаТЧ["Субконто"+Сч] = Объект.ДоговорКонтрагента;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
				СтрокаТЧ["Субконто"+Сч] = ?(ЗначениеЗаполнено(Билет), Билет, СтрокаТЧ.Номенклатура);
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
				СтрокаТЧ["Субконто"+Сч] = НоменклатурнаяГруппа;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
				СтрокаТЧ["Субконто"+Сч] = Подразделение;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций Тогда
				СтрокаТЧ["Субконто"+Сч] = ФизическоеЛицо;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто.Наименование = "Виды расчетов с персоналом" И ЗначениеЗаполнено(ВидРасчетовСПерсоналом) Тогда
				СтрокаТЧ["Субконто"+Сч] = ВидРасчетовСПерсоналом;  				
			КонецЕсли;
			
		КонецЦикла;
		
		Счет = СтрокаТЧ.СчетЗатратНУ;
		
		ЧислоАктивныхСубконто = Счет.ВидыСубконто.Количество();
		
		Для Сч = 1 По ЧислоАктивныхСубконто Цикл
			
			Если Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = СтатьяЗатрат;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = СтатьяЗатрат;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = Объект.Контрагент;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = Объект.ДоговорКонтрагента;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = СтрокаТЧ.Номенклатура;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = НоменклатурнаяГруппа;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОбособленныеПодразделения Тогда
				СтрокаТЧ["СубконтоНУ"+Сч] = Подразделение;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций Тогда
				СтрокаТЧ["Субконто"+Сч] = ФизическоеЛицо;
			ИначеЕсли Счет.ВидыСубконто[Сч-1].ВидСубконто.Наименование = "Виды расчетов с персоналом" И ЗначениеЗаполнено(ВидРасчетовСПерсоналом) Тогда
				СтрокаТЧ["Субконто"+Сч] = ВидРасчетовСПерсоналом; 	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// -- заполняем сотрудников для билетов --
	Если СтрокаТЧ.СчетЗатрат = ПланыСчетов.Хозрасчетный.ДенежныеДокументы Тогда
		СтрокаТЧ.Субконто1 = Справочники.ДенежныеДокументы.НайтиПоНаименованию("Билеты");
		Если ЗначениеЗаполнено(СтрокаТЧ.Субконто2) и Не ЗначениеЗаполнено(СтрокаТЧ.Субконто3) Тогда 		
			// -- ищем по билету сотрудника --
			Строка = Объект.Услуги.Найти(СтрокаТЧ.Субконто2, "Номенклатура");
			
			Если Строка <> Неопределено Тогда
				СтрокаТЧ.Субконто3 = Строка.Субконто3;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецЦикла;

Если Объект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
КонецЕсли;

//Объект.Дата = КонецДня(Объект.Дата);

Выполнить(Алгоритмы.ПровестиДокумент);