ВЫБРАТЬ
	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	ВЫБОР
		КОГДА СУММА(ЕСТЬNULL(ПродажиСебестоимость.Количество, 0)) = 0
				ИЛИ МАКСИМУМ(СправочникЕдиницыИзмеренийХранения.Коэффициент) = 0
			ТОГДА 0
		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(ПродажиСебестоимость.Стоимость, 0)) / СУММА(ЕСТЬNULL(ПродажиСебестоимость.Количество, 0)) * МАКСИМУМ(СправочникЕдиницыИзмеренийДокумент.Коэффициент) / МАКСИМУМ(СправочникЕдиницыИзмеренийХранения.Коэффициент) КАК ЧИСЛО(17, 4))
	КОНЕЦ КАК Себестоимость,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.КлючСтроки) КАК КлючСтроки,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмеренияМест) КАК ЕдиницаИзмеренияМест,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Коэффициент) КАК Коэффициент,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Цена) КАК Цена,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.Сумма) КАК Сумма,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.СтавкаНДС) КАК СтавкаНДС,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.СуммаНДС) КАК СуммаНДС,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.КоличествоМест) КАК КоличествоМест,
	МАКСИМУМ(ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры) КАК СерияНоменклатуры
ИЗ
	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		ПО (ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка)
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
		ПО (ВозвратТоваровОтПокупателяТовары.Ссылка = ПродажиСебестоимость.Регистратор)
			И (ВозвратТоваровОтПокупателяТовары.Номенклатура = ПродажиСебестоимость.Номенклатура)
			И (ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры = ПродажиСебестоимость.ХарактеристикаНоменклатуры)
			//И (ВЫБОР
			//	КОГДА &ПоСчетам
			//		ТОГДА ВозвратТоваровОтПокупателя.Сделка = ПродажиСебестоимость.ЗаказПокупателя
			//	ИНАЧЕ ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя = ВЫБОР
			//			КОГДА ПродажиСебестоимость.ЗаказПокупателя = НЕОПРЕДЕЛЕНО
			//				ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
			//			ИНАЧЕ ПродажиСебестоимость.ЗаказПокупателя
			//		КОНЕЦ
			//КОНЕЦ)
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		ПО (СправочникНоменклатура.Ссылка = ВозвратТоваровОтПокупателяТовары.Номенклатура)
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СправочникЕдиницыИзмеренийДокумент
		ПО (СправочникЕдиницыИзмеренийДокумент.Владелец = ВозвратТоваровОтПокупателяТовары.Номенклатура)
			И (СправочникЕдиницыИзмеренийДокумент.Ссылка = ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения)
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СправочникЕдиницыИзмеренийХранения
		ПО (СправочникЕдиницыИзмеренийХранения.Владелец = СправочникНоменклатура.Ссылка)
			И (СправочникЕдиницыИзмеренийХранения.Ссылка = СправочникНоменклатура.ЕдиницаХраненияОстатков)
ГДЕ
	ВозвратТоваровОтПокупателя.Ссылка = &Ссылка

СГРУППИРОВАТЬ ПО
	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
	ВозвратТоваровОтПокупателяТовары.НомерСтроки,
	ВозвратТоваровОтПокупателяТовары.ДокументПартии