Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Для каждого СтрокаТЧ из Объект.Товары Цикл

	Документы.ВозвратТоваровОтПокупателя.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(Объект, СтрокаТЧ, "Товары");

	Если СтрокаТЧ.СчетДоходов.ВидыСубконто.Количество() > 0 Тогда
		СтрокаТЧ.Субконто = Новый(СтрокаТЧ.СчетДоходов.ВидыСубконто[0].ВидСубконто.ТипЗначения.Типы()[0]);
		Если ТипЗнч(СтрокаТЧ.Субконто) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			СтрокаТЧ.Субконто = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
		КонецЕсли;
	Иначе
		СтрокаТЧ.Субконто = Неопределено;
	КонецЕсли;
	
КонецЦикла;

Документы.ВозвратТоваровОтПокупателя.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ВозвратнаяТара");

СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);

Объект.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетовПокупателя;
Объект.СчетУчетаРасчетовПоАвансам        = СчетаУчета.СчетАвансовПокупателя;
Объект.СчетУчетаРасчетовПоТаре           = СчетаУчета.СчетУчетаТарыПокупателя;

Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
	Объект.Склад = Параметры.СкладДляОбменаДаннымиСУТ;
КонецЕсли;

Для каждого СтрокаТЧ Из Объект.Товары Цикл
	СтрокаТЧ.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
КонецЦикла;

Если Объект.ЭтоНовый() Тогда
	Объект.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ;
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);