Если Источник.Код = "20.01.1" ИЛИ Источник.Код = "20.01.2" Тогда
	Значение = "20.01";
ИначеЕсли Источник.Код = "25.01" ИЛИ Источник.Код = "25.02" Тогда
	Значение = "25";
ИначеЕсли Источник.Код = "26.02" Тогда
	Значение = "26";
ИначеЕсли Лев(Источник.Код, 5) = "91.02" Тогда
	Значение = "91.02";
// 1СTeam Фасхетдинов Д.М. 11.03.2022 [T1C-2166] НАЧАЛО
ИначеЕсли Источник.Код = "10.21" Тогда
	Значение = "10.21.1";
// 1СTeam Фасхетдинов Д.М. 11.03.2022 [T1C-2166] КОНЕЦ
Иначе
	Значение = Источник.Код;
КонецЕсли;