Если ТипЗнч(Источник) = Тип("СправочникСсылка.Контрагенты") Тогда
    
    Если Источник.ЭтоГруппа Тогда
        // -- выгружаем как положенно --
    ИначеЕсли Источник.ВходитВХолдинг и Найти(Источник.Наименование, "*") <> 0 Тогда
        Отказ = Истина;
    ИначеЕсли Источник.Родитель.Код = "000003337" Тогда
        // -- всех сотрудников так же выгружаем --
    ИначеЕсли Найти(Источник.НаименованиеПолное, "ИФНС") > 0 ИЛИ Найти(Источник.НаименованиеПолное, "УФК") > 0 ИЛИ Найти(Источник.НаименованиеПолное, "ФСС") > 0 Тогда
        // -- налоговые инспеции ... по ним нет договоров --
    Иначе
        
        ПараметрыОтбора = Новый Структура;
        ПараметрыОтбора.Вставить("Организация", Параметры.ОрганизацияВыгрузки);
        
        // -- выгружаем только тех с кем заключен официальный договор --
        Если Не Справочники.ДоговорыКонтрагентов.Выбрать(, Источник.Ссылка, ПараметрыОтбора).Следующий() Тогда
            
            Запрос = Новый Запрос;
            Запрос.Текст = 
            "ВЫБРАТЬ ПЕРВЫЕ 1
            |	ПлатежноеПоручениеИсходящее.Контрагент
            |ИЗ
            |	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
            |ГДЕ
            |	ПлатежноеПоручениеИсходящее.Организация = &Организация
            |	И ПлатежноеПоручениеИсходящее.Контрагент = &Контрагент";
            
            Запрос.УстановитьПараметр("Организация", Параметры.ОрганизацияВыгрузки);
            Запрос.УстановитьПараметр("Контрагент", Источник.Ссылка);
            РезультатЗапроса = Запрос.Выполнить();
            
            Если РезультатЗапроса.Пустой() Тогда
                Отказ = Истина;
            КонецЕсли;
            
        КонецЕсли;
        
    КонецЕсли;
    
    Если НЕ Источник.ЭтоГруппа Тогда
        ВходящиеДанные = Новый Структура("ОсновноеКонтактноеЛицо");
        ВходящиеДанные.ОсновноеКонтактноеЛицо = Источник.ОсновноеКонтактноеЛицо.КонтактноеЛицо;
    КонецЕсли;
Иначе
    Отказ = Истина;
КонецЕсли;