Если СвойстваПоиска["ЭтоГруппа"] Тогда
	СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
Иначе

	Если НомерВариантаПоиска = 1 И (ЗначениеЗаполнено(СвойстваПоиска["ИНН"]) ИЛИ ЗначениеЗаполнено(СвойстваПоиска["КПП"])) Тогда
		СтрокаИменСвойствПоиска = "Код, ИНН, КПП, Наименование";
	ИначеЕсли НомерВариантаПоиска = 2 И (ЗначениеЗаполнено(СвойстваПоиска["ИНН"]) ИЛИ ЗначениеЗаполнено(СвойстваПоиска["КПП"])) Тогда
		СтрокаИменСвойствПоиска = "Код, ИНН, КПП";
	Иначе
 		СтрокаИменСвойствПоиска = "Код, НаименованиеПолное";
	КонецЕсли;

КонецЕсли;