// -- обработка ТЧ Продукция --
Объект.Продукция.Очистить();
Объект.СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;

новСтрока = Объект.Продукция.Добавить();
новСтрока.Номенклатура = ПараметрыОбъекта["Номенклатура"];
новСтрока.Количество = ПараметрыОбъекта["Количество"];


ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);

ЕстьПродукция = Объект.Продукция.Количество() <> 0;

// -- обработка ТЧ Комплектующие --
Для каждого СтрокаТабличнойЧасти из Объект.Материалы Цикл
	
	СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(
		СтрокаТабличнойЧасти.Номенклатура, ДанныеОбъекта);
		Если СведенияОНоменклатуре <> Неопределено Тогда
			
			СтрокаТабличнойЧасти.ЕдиницаИзмерения		= СведенияОНоменклатуре.ЕдиницаИзмерения;
			СтрокаТабличнойЧасти.Коэффициент			= СведенияОНоменклатуре.Коэффициент;
			
			//СтрокаТабличнойЧасти.СтатьяЗатрат			= ?(ЗначениеЗаполнено(СведенияОНоменклатуре.СтатьяЗатрат), 
			//	СведенияОНоменклатуре.СтатьяЗатрат,	ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиЗатрат.СписаниеМатериалов"));
			СтрокаТабличнойЧасти.СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("000000049");
			
			//СтрокаТабличнойЧасти.НоменклатурнаяГруппа	= СведенияОНоменклатуре.НоменклатурнаяГруппа;
			Если ЕстьПродукция Тогда
				СтрокаТабличнойЧасти.НоменклатурнаяГруппа = Объект.Продукция[0].Номенклатура.НоменклатурнаяГруппа;
			КонецЕсли;	
			СтрокаТабличнойЧасти.СпособУчетаНДС			= СведенияОНоменклатуре.СпособУчетаНДС;	
			СтрокаТабличнойЧасти.ОтражениеВУСН	= Перечисления.ОтражениеВУСН.Принимаются;
			
		
		КонецЕсли;

КонецЦикла;


ДанныеОбъекта.Вставить("ТипЦенПлановойСебестоимости", Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить());
ДанныеОбъекта.Вставить("СпособЗаполненияПлановойСебестоимости", Перечисления.СпособыЗаполненияЦен.ПоПлановымЦенам);	

СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(
новСтрока.Номенклатура, ДанныеОбъекта);

Если СведенияОНоменклатуре <> Неопределено Тогда
	
	новСтрока.ЕдиницаИзмерения		= СведенияОНоменклатуре.ЕдиницаИзмерения;
	новСтрока.Коэффициент			= СведенияОНоменклатуре.Коэффициент;
	новСтрока.Спецификация			= СведенияОНоменклатуре.ОсновнаяСпецификацияНоменклатуры;
	новСтрока.НоменклатурнаяГруппа	= СведенияОНоменклатуре.НоменклатурнаяГруппа;
	
КонецЕсли;

новСтрока.ПлановаяСтоимость		= 1;
новСтрока.СуммаПлановая 		= новСтрока.Количество * новСтрока.ПлановаяСтоимость;
новСтрока.Счет					= ПланыСчетов.Хозрасчетный.ГотоваяПродукция;

Объект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);

Выполнить(Алгоритмы.ПровестиДокумент);