Запросы.Затраты.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
Запросы.Затраты.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
Запросы.Затраты.УстановитьПараметр("Организация", Параметры.ОрганизацияВыгрузки);
Запросы.Затраты.УстановитьПараметр("МесяцДокумента", НачалоМесяца(Источник.Ссылка.Дата));

РезультатЗапроса = Запросы.Затраты.Выполнить();

ТабЗатрат = РезультатЗапроса.Выгрузить();

Для Каждого текСтрока из ТабЗатрат Цикл
	Если Не ЗначениеЗаполнено(текСтрока.НоменклатурнаяГруппа) Тогда
		текСтрока.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.НайтиПоКоду("000000020");
	КонецЕсли;
КонецЦикла;

ТабЗатрат.Свернуть("НоменклатурнаяГруппа, СтатьяЗатрат, Подразделение, ДокументЗатрат", "Сумма");

КоллекцияОбъектов = ТабЗатрат;