Выполнить(Алгоритмы.МожноВыгружатьДокумент);

Если Не Отказ и Источник.СкладПолучатель.Родитель.Код = "000000062" Тогда
	
	// -- создаем документ "Передача товаров" --
	Отказ = Истина;
	//ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ПередачаТоваров");
	
КонецЕсли;

Если Не Отказ и Источник.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ОтпускТМЦнаСторону Тогда
	
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ПередачаТоваровНаПроизводство");
	
ИначеЕсли Не Отказ и Источник.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.ВозвратТМЦ Тогда
	
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "ВозвратМатериаловОтПереработчика");
	
КонецЕсли;