Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	Объект.Организация = Параметры.ОсновнаяОрганизация;
КонецЕсли;

Если (НЕ ЗначениеЗаполнено(Объект.СкладОтправитель))  Тогда	
	Объект.СкладОтправитель = Параметры.СкладДляОбменаДаннымиСУТ; 
КонецЕсли;

Если (НЕ ЗначениеЗаполнено(Объект.СкладПолучатель)) Тогда 	
	Объект.СкладПолучатель = Параметры.СкладДляОбменаДаннымиСУТ;	
КонецЕсли; 

Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ВозвратнаяТара");

Если Объект.НДСвСтоимостиТоваров = Перечисления.ДействиеНДСВСтоимостиТоваров.ВключитьВСтоимость тогда
	Документы.ПеремещениеТоваров.ЗаполнитьСчетаСписанияНДСЗначениямиПоУмолчанию(Объект);
КонецЕслИ;

Для каждого СтрокаТабЧасти Из Объект.ТоварыНаКомиссии Цикл
	СтрокаТабЧасти.СчетУчета = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе;
	СтрокаТабЧасти.НовыйСчетУчета = ПланыСчетов.Хозрасчетный.ТоварыНаСкладе;
КонецЦикла;

Выполнить(Алгоритмы.ПровестиДокумент);