
Строки = Источник.СоставНабораУслуг.НайтиСтроки(Новый Структура("КлючСтроки",ОбъектКоллекции.КлючСтроки));

Содержание = ОбъектКоллекции.Содержание;

Если Строки.Количество() > 0 Тогда

	СоставНабора = ":";
	Для каждого СтрокаСостава из Строки Цикл
		
		СоставНабора = СоставНабора + " " + СтрокаСостава.Номенклатура.НаименованиеПолное + " - " + Строка(СтрокаСостава.Количество) + " (" + СтрокаСостава.Номенклатура.БазоваяЕдиницаИзмерения.Наименование + ");"
		
	КонецЦикла;
	
	Содержание = Содержание + СоставНабора;
	
КонецЕсли;

Значение = Содержание;