	Для каждого СтрокаТЧ Из Объект.ДокументыОснования Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДокументОснование) Тогда 
			Объект.ДокументыОснования.Удалить(СтрокаТЧ); 
		КонецЕсли;
	КонецЦикла;
	
	
	Если Объект.Продавцы.Количество() > 0 Тогда
		Объект.Продавец = Объект.Продавцы[0].Продавец;
		Если Объект.Продавцы.Количество() > 1 Тогда
			Объект.КодВидаОперации = "27";
		КонецЕсли;
	Иначе
		Объект.Продавец = Документы.СчетФактураВыданный.ПустаяСсылка();
	КонецЕсли;
	
	Выполнить(Алгоритмы.ПровестиДокумент);