ВЫБРАТЬ РАЗЛИЧНЫЕ
	СобственныеКонтрагенты.Объект
ИЗ
	(ВЫБРАТЬ
		ОборудованиеКлиентовОстатки.СервисныйЦентр КАК СервисныйЦентр
	ИЗ
		РегистрНакопления.ОборудованиеКлиентов.Остатки(
				&КонецПериода,
				МодельОборудования.ТипОборудования = &ТипОборудования
					И (Площадка = &Площадка
						ИЛИ Площадка.НоваяПлощадка = &Площадка)) КАК ОборудованиеКлиентовОстатки) КАК Оборудование
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
		ПО Оборудование.СервисныйЦентр = СобственныеКонтрагенты.Контрагент
ГДЕ
	СобственныеКонтрагенты.ВидСвязи = &ВидСвязи
	И СобственныеКонтрагенты.Объект.Код <> &КодОрганизации