Если НЕ Параметры.ПервыйОбмен 
	И Параметры.ОписаниеТиповДокументы.СодержитТип(ТипЗнч(Источник)) Тогда
	
	Отказ = Ложь;
	
	ПараметрИсточник = Источник;
	
	Выполнить(Алгоритмы.ВозможностьВыгрузкиОбъектаПоФильтрам);
	
	ТипДокумента = ТипЗнч(Источник);
	
	Если (НЕ Отказ) 
		И Параметры.ОписаниеТиповДокументыСФ.СодержитТип(ТипДокумента) 
		И ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
		
		ПараметрИсточник = Источник.ДокументОснование;
		Выполнить(Алгоритмы.ВозможностьВыгрузкиОбъектаПоФильтрам);
				
	КонецЕсли;	
	
КонецЕсли;