Параметры.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
Параметры.Вставить("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());

//УзелДляОбмена = ПланыОбмена.ОбменУправлениеТорговлей103БухгалтерияПредприятия30.НайтиПоКоду("КИ"); // Для тестирования ручной выгрузки
// 1СTeam Томилин А.П. 25.10.2022 [T1C-2645] НАЧАЛО
Если Параметры.Свойство("КодУзлаОтладки") И ЗначениеЗаполнено(Параметры.КодУзлаОтладки) Тогда
	УзелДляОбмена = ПланыОбмена.ОбменУправлениеТорговлей103БухгалтерияПредприятия30.НайтиПоКоду(Параметры.КодУзлаОтладки);
КонецЕсли;
// 1СTeam Томилин А.П. 25.10.2022 [T1C-2645] КОНЕЦ

ОрганизацииВыгрузки = УзелДляОбмена.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
Параметры.Вставить("ОрганизацияВыгрузки", ОрганизацииВыгрузки[0]);

НаборЗаписей = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(, Новый Структура("Организация", Параметры.ОрганизацияВыгрузки));
НаборЗаписей.Свернуть("ФизЛицо", "Показатель");
Параметры.Вставить("РаботающиеФизЛица", НаборЗаписей);

СкладыПодмены = Новый ТаблицаЗначений;
СкладыПодмены.Колонки.Добавить("Склад");
СкладыПодмены.Колонки.Добавить("Площадка");
СкладыПодмены.Колонки.Добавить("ТипОборудования");
СкладыПодмены.Колонки.Добавить("СкладПодмены");
Параметры.Вставить("СкладыПодмены", СкладыПодмены);

НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
НаборЗаписей.Прочитать();
Параметры.Вставить("СобственныеКонтрагенты", НаборЗаписей.Выгрузить());
Параметры.Вставить("АвтоЗачетОплаты", Ложь);
	
Если НЕ Параметры.ПервыйОбмен Тогда
	
	Параметры.Вставить("ДатаНачалаВыгрузкиДокументов",УзелДляОбмена.ДатаНачалаВыгрузкиДокументов);
	Параметры.Вставить("ПередаватьТолькоДокументыОтраженныеВБухгалтерскомУчете",УзелДляОбмена.ПередаватьТолькоДокументыОтраженныеВБухгалтерскомУчете);
	
	Параметры.Вставить("ИспользоватьФильтрПоОрганизациям",?(УзелДляОбмена.Организации.Количество()>0,Истина,Ложь));
	Параметры.Вставить("ИспользоватьФильтрПоСкладам",?(УзелДляОбмена.Склады.Количество()>0,Истина,Ложь));
	Параметры.Вставить("ИспользоватьФильтрПоПодразделениям",?(УзелДляОбмена.Подразделения.Количество()>0,Истина,Ложь));
	
	Если Параметры.ИспользоватьФильтрПоОрганизациям Тогда
		
		Параметры.Вставить("МассивОрганизаций",УзелДляОбмена.Организации.Выгрузить().ВыгрузитьКолонку("Организация"));
		
	КонецЕсли;
	
	Если Параметры.ИспользоватьФильтрПоСкладам Тогда
		
		Параметры.Вставить("МассивСкладов",УзелДляОбмена.Склады.Выгрузить().ВыгрузитьКолонку("Склад"));
		
	КонецЕсли;
	
	Если Параметры.ИспользоватьФильтрПоПодразделениям Тогда
		
		Параметры.Вставить("МассивПодразделений",УзелДляОбмена.Подразделения.Выгрузить().ВыгрузитьКолонку("Подразделение"));
		
	КонецЕсли;
	
	МассивТиповДокументов = Новый Массив;
	
	Для каждого МетаДокумент Из Метаданные.Документы цикл
		
		МассивТиповДокументов.Добавить(Тип("ДокументСсылка." + МетаДокумент.Имя));
		МассивТиповДокументов.Добавить(Тип("ДокументОбъект." + МетаДокумент.Имя));
		
	КонецЦикла;
	
	ОписаниеТиповДокументы = Новый ОписаниеТипов(МассивТиповДокументов);
	Параметры.Вставить("ОписаниеТиповДокументы",ОписаниеТиповДокументы);
	
	МассивТиповДокументов.Очистить();
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.СчетФактураВыданный"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.СчетФактураПолученный"));
	МассивТиповДокументов.Добавить(Тип("ДокументОбъект.СчетФактураПолученный"));
	МассивТиповДокументов.Добавить(Тип("ДокументОбъект.СчетФактураВыданный"));
	
	ОписаниеТиповДокументы = Новый ОписаниеТипов(МассивТиповДокументов);
	
	Параметры.Вставить("ОписаниеТиповДокументыСФ",ОписаниеТиповДокументы);

КонецЕсли;
// Документы расчетов (БП зачет аванса), несовместимые типы документов.
// Обмен не поддерживается.
СтруктураНевыгружаемыхДокументовРасчетов = Новый Структура();
// СписаниеСРасчетногоСчета
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("СписаниеСРасчетногоСчета", Массив);
// ПоступлениеНаРасчетныйСчет
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ИнкассовоеПоручениеПереданное"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПолученный"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("ПоступлениеНаРасчетныйСчет", Массив);
// ПоступлениеТоваровУслуг
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
//Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("ПоступлениеТоваровУслуг", Массив);
// ПриходныйКассовыйОрдер
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре"));
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ИнкассовоеПоручениеПереданное"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПолученный"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("ПриходныйКассовыйОрдер", Массив);
// РасходныйКассовыйОрдер
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре"));
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ИнкассовоеПоручениеПолученное"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"));
Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПереданный"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств"));
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеПолученное"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("РасходныйКассовыйОрдер", Массив);
// РеализацияТоваровУслуг
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
Массив.Добавить(Тип("ДокументСсылка.ИнкассовоеПоручениеПолученное"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПереданный"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеПолученное"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("РеализацияТоваровУслуг", Массив);
// ПоступлениеДопРасходов
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщикуИзНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ИнкассовоеПоручениеПереданное"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПолученный"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("ПоступлениеДопРасходов", Массив);
// ОтчетКомиссионераОПродажах
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтПокупателя"));
Массив.Добавить(Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом"));
Массив.Добавить(Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
Массив.Добавить(Тип("ДокументСсылка.АккредитивПереданный"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств"));
Массив.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
Массив.Добавить(Тип("ДокументСсылка.ПлатежноеТребованиеПолученное"));
Массив.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));
Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("ОтчетКомиссионераОПродажах", Массив);
// КорректировкаДолга
Массив = Новый Массив();
Массив.Добавить(Тип("ДокументСсылка.ОтражениеРеализацииТоваровИУслугНДС"));
Массив.Добавить(Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре"));
Массив.Добавить(Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой"));
Массив.Добавить(Тип("ДокументСсылка.ОтражениеПоступленияТоваровИУслугНДС"));
СтруктураНевыгружаемыхДокументовРасчетов.Вставить("КорректировкаДолга", Массив);
///////////////
Параметры.СтруктураНевыгружаемыхДокументовРасчетов = СтруктураНевыгружаемыхДокументовРасчетов;