
//рекомендуемые настройки поиска
ВариантыНастроекПоиска = Новый Структура;
ВариантыНастроекПоиска.Вставить("Контрагенты","ИННКППНаименование");
ВариантыНастроекПоиска.Вставить("Организации","ИННКППНаименование");
ВариантыНастроекПоиска.Вставить("Номенклатура","НаименованиеРодительЭтоГруппа");
ВариантыНастроекПоиска.Вставить("ФизическиеЛица","НаименованиеДатаРождения");

//рекомендуемые настройки поиска для перехода с предыдущего обмена
ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена = Новый Структура;
ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена.Вставить("Контрагенты","ИННКППНаименование");
ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена.Вставить("Организации","ИННКППНаименование");
ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена.Вставить("Номенклатура","КодЭтоГруппа");
ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена.Вставить("ФизическиеЛица","НаименованиеДатаРождения");

//после чтения правил данные параметры будут доступны для анализа
Параметры.Вставить("ВариантыНастроекПоиска",ВариантыНастроекПоиска);
Параметры.Вставить("ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена",ВариантыНастроекПоискаДляПереходаСПредыдущегоОбмена);

//настройки поиска с условиями. 
ПоискБезВариантовПоиска  = Новый Структура;
ПоискБезВариантовПоиска.Вставить("ДоговорыКонтрагентов","НаименованиеВладелецВалютаВзаиморасчетовВедениеВзаиморасчетовОрганизацияВидДоговора");
ПоискБезВариантовПоиска.Вставить("Склады","НаименованиеВидСклада");

Параметры.Вставить("ПоискБезВариантовПоиска",ПоискБезВариантовПоиска);
Параметры.Вставить("ПервыйОбмен",Истина);

Параметры.Вставить("ЛогФайл", Новый ТекстовыйДокумент());