
МетаданныеОбъекта = Объект.Метаданные();

Если Метаданные.Документы.Содержит(МетаданныеОбъекта) 
	ИЛИ Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		
		Отказ  = Истина;
		ТипОбъекта = ТипЗнч(Объект);
		
		Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) 
			И НЕ Объект.Предопределенный Тогда
			
			Объект.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли;
		
		
		Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
			
			Если Объект.Проведен Тогда
				
				ОтменитьПроведениеОбъектаВИБ(Объект, ТипОбъекта);
				
			КонецЕсли;
			
			Объект.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли;
		
КонецЕсли;