
СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Объект.Организация, Объект.Контрагент, Объект.ДоговорКонтрагента);

Объект.СчетУчетаРасчетовСКонтрагентом    = СчетаУчета.СчетРасчетов;
Объект.СчетУчетаРасчетовПоПретензиям     = СчетаУчета.СчетРасчетовПоПретензиям;
Объект.СчетУчетаРасчетовПоТаре           = СчетаУчета.СчетУчетаТары;

Объект.ДополнительныеСвойства.Свойство("ЗаполнитьСчетаУчетаПередЗаписью");

Документы.ВозвратТоваровПоставщику.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");

Выполнить(Алгоритмы.ПровестиДокумент);