Если ЗначениеЗаполнено(ОбъектКоллекции.ХарактеристикаНоменклатуры) и (ОбъектКоллекции.СтатьяЗатрат.Наименование = "Билеты"
	или ОбъектКоллекции.СтатьяЗатрат.Код = "000000213" или ОбъектКоллекции.СтатьяЗатрат = БП_ОбщийПривилегированный.ПолучитьЗначениеНастройки("ШтрафыГИБДД","СтатьяЗатрат") или ОбъектКоллекции.СтатьяЗатрат = БП_ОбщийПривилегированный.ПолучитьЗначениеНастройки("СписокСтатейЗатрат","Такси") или ОбъектКоллекции.СтатьяЗатрат = БП_ОбщийПривилегированный.ПолучитьЗначениеНастройки("СписокСтатейЗатрат","ТаксиНеПринимаемая")) Тогда
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000027"); // "Сотрудник"
	Значение = ксОбщийМодуль.ПолучитьСвойствоОбъекта(ОбъектКоллекции.ХарактеристикаНоменклатуры, Свойство);
	ИмяПКО = "ФизическиеЛица";
	
	Если Не ЗначениеЗаполнено(Значение) Тогда // т.е. это страховка
		Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("000000030"); // "Сотрудник"
		Значение = ксОбщийМодуль.ПолучитьСвойствоОбъекта(ОбъектКоллекции.ХарактеристикаНоменклатуры, Свойство);
		ИмяПКО = "Номенклатура";
	КонецЕсли;
	
КонецЕсли;