Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление Тогда
	Если Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000180" Тогда
		Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
		Объект.СубконтоКт1 = Объект.Контрагент;
		Объект.СубконтоКт2 = Объект.РасшифровкаПлатежа[0].ДоговорКонтрагента;
	Иначе
		Если ПараметрыОбъекта <> Неопределено И ПараметрыОбъекта.Получить("ВозвратСредствПодотчетником") Тогда
			//Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами;	
		Иначе	
			Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
		КонецЕсли;	
	КонецЕсли;
КонецЕсли;

Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	//Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда
		
		СтруктураСчетов = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
				Объект.Организация,
				Объект.Контрагент,
				СтрокаПлатеж.ДоговорКонтрагента
		);
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя; // Обычно 62.01
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансовПокупателя; // Обычно 62.02
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов; // Обычно 60.01
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансов; // Обычно 60.02
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты Тогда
			Если Объект.ОтражатьРазницуВКурсеВСоставеОперационныхРасходов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
			Иначе
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			КонецЕсли;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажиИностраннойВалюты Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда	
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
		КонецЕсли;
		
	//КонецЕсли;
КонецЦикла;

Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам Тогда
	
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ИздержкиОбращения;
	
КонецЕсли;

ИмяРеквизита = "СчетБанк";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);
Выполнить(Алгоритмы.ПровестиДокумент);