Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")
	ИЛИ ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
	
	ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Неопределено;
	
	Если Параметры.Свойство("ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю", ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю) Тогда
		Если ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.СчетНаОплатуПокупателю
			И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			ИмяПКО = "СчетНаОплатуПокупателю";
		ИначеЕсли ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.ЗаказПокупателя 
			И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")Тогда
			ИмяПКО = "ЗаказПокупателяСчетНаОплатуПокупателю";
		Иначе
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
ИначеЕсли ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное") тогда
	
	ИмяПКО = "ПлатежноеТребованиеВыставленное";
	
Иначе
	
	Отказ = Истина;		
	
КонецЕсли;