Выполнить(Алгоритмы.МожноВыгружатьДокумент);

ДокСФ = УчетНДС.НайтиПодчиненныйДокумент(Источник.Ссылка, "СчетФактураВыданный");

ВходящиеДанные = Новый Структура("НомерИсправления", 0);

Если ДокСФ <> Неопределено Тогда
	
	ВходящиеДанные.Вставить("НомерИсправления", ДокСФ.НомерИсправления);

КонецЕсли;

// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-4047] НАЧАЛО
СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок = Новый Соответствие;
	 
ТЧРНПТ = Источник.кси_РНПТ_В_СоставеУслуг.Выгрузить(, "КлючСтроки");
ТЧРНПТ.Свернуть("КлючСтроки");
ТЧРНПТ.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));

Для каждого СтрокаРНПТ ИЗ ТЧРНПТ Цикл
	СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок.Вставить(СтрокаРНПТ.КлючСтроки, Строка(Новый УникальныйИдентификатор));
КонецЦикла;

//входящие данные определены выше, проверка на ВходящиеДанные = Неопределено не нужна
ВходящиеДанные.Вставить("СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок", СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок);

ТЧ = Источник.СведенияПрослеживаемости.Выгрузить();

ТЧ.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));   
ТЧ.Колонки.Добавить("СтоимостьБезНДС", 			Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)));   
ТЧ.Колонки.Добавить("СуммаНДС", 				Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)));   
ТЧ.Колонки.Добавить("СтранаПроисхождения",		Новый ОписаниеТипов("СправочникСсылка.КлассификаторСтранМира"));
ТЧ.Колонки.Добавить("ИсходнаяСтрока", 			Новый ОписаниеТипов("Булево"));

ТаблицаРНПТ_В_СоставеУслуг = Источник.кси_РНПТ_В_СоставеУслуг.Выгрузить();
Если ТаблицаРНПТ_В_СоставеУслуг.Колонки.Найти("ИдентификаторСтроки") = Неопределено Тогда
	ТаблицаРНПТ_В_СоставеУслуг.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
КонецЕсли;

Если ВходящиеДанные <> Неопределено Тогда
	Для Каждого СтрокаРНПТ Из ТаблицаРНПТ_В_СоставеУслуг Цикл
		ИдПоКлючуСтроки = СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок.Получить(СтрокаРНПТ.КлючСтроки);
		СтрокаРНПТ.ИдентификаторСтроки = ?(НЕ ЗначениеЗаполнено(ИдПоКлючуСтроки), "", ИдПоКлючуСтроки);
	КонецЦикла;
КонецЕсли;
 
ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРНПТ_В_СоставеУслуг, ТЧ);
ВходящиеДанные.Вставить("СведенияПрослеживаемости", ТЧ);
// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-4047] КОНЕЦ
