Документы.КорректировкаРеализации.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
Документы.КорректировкаРеализации.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Услуги");

Для Каждого СтрокаТЧ из Объект.СоставНабора Цикл  	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТЧ.Номенклатура, Объект.Склад);
	СтрокаТЧ.СчетУчета = СчетаУчета.СчетУчета;
	СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
КонецЦикла;

//Карпухин 06.12.2021
ТабличныеЧастиОснования = Объект.ДокументРеализации.Метаданные().ТабличныеЧасти;
ЕстьСведенияПрослеживаемости = ТабличныеЧастиОснования.Найти("СведенияПрослеживаемости") <> Неопределено;
Если ЕстьСведенияПрослеживаемости Тогда
		
	СведенияПрослеживаемости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументРеализации, "СведенияПрослеживаемости");
	Если ЗначениеЗаполнено(СведенияПрослеживаемости) Тогда

		ИсходныеСведенияПрослеживаемости = СведенияПрослеживаемости.Выгрузить();
		ЭтоПовторнаяКорректировка = ИсходныеСведенияПрослеживаемости.Колонки.Найти("ЭтоСтрокаСИсходнымиРНПТ") <> Неопределено;
		Для Каждого СтрокаСведений Из ИсходныеСведенияПрослеживаемости Цикл
			Если ЭтоПовторнаяКорректировка
				И СтрокаСведений.ЭтоСтрокаСИсходнымиРНПТ Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСведений);
			НоваяСтрока.ЭтоСтрокаСИсходнымиРНПТ = Истина;
		КонецЦикла;
		
	КонецЕсли;
КонецЕсли;
//-------------------

Выполнить(Алгоритмы.ПровестиДокумент);