
Параметры.АвтоЗачетОплаты = ЗначениеЗаполнено(Параметры.СобственныеКонтрагенты.Найти(Источник.Контрагент,"Контрагент"));

// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-3229] НАЧАЛО
СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок = Новый Соответствие;
	 
ТЧРНПТ = Источник.кси_РНПТ_В_СоставеУслуг.Выгрузить(, "КлючСтроки");
ТЧРНПТ.Свернуть("КлючСтроки");
ТЧРНПТ.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));

Для каждого СтрокаРНПТ ИЗ ТЧРНПТ Цикл
	СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок.Вставить(СтрокаРНПТ.КлючСтроки, Строка(Новый УникальныйИдентификатор));
КонецЦикла;

Если ВходящиеДанные = Неопределено Тогда
	ВходящиеДанные = Новый Структура;
КонецЕсли;
ВходящиеДанные.Вставить("СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок", СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок);

ТЧ = Источник.СведенияПрослеживаемости.Выгрузить();

ТЧ.Колонки.Добавить("Номенклатура", 		Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));   
ТЧ.Колонки.Добавить("СтоимостьБезНДС", 	Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)));   
ТЧ.Колонки.Добавить("СуммаНДС", 			Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 2)));   
ТЧ.Колонки.Добавить("СтранаПроисхождения",Новый ОписаниеТипов("СправочникСсылка.КлассификаторСтранМира"));

ТаблицаРНПТ_В_СоставеУслуг = Источник.кси_РНПТ_В_СоставеУслуг.Выгрузить();
Если ТаблицаРНПТ_В_СоставеУслуг.Колонки.Найти("ИдентификаторСтроки") = Неопределено Тогда
	ТаблицаРНПТ_В_СоставеУслуг.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
КонецЕсли;

Если ВходящиеДанные <> Неопределено Тогда
	Для Каждого СтрокаРНПТ Из ТаблицаРНПТ_В_СоставеУслуг Цикл
		ИдПоКлючуСтроки = СоответствиеКлючейСтрокиУслугИ_РНПТИдентификаторовСтрок.Получить(СтрокаРНПТ.КлючСтроки);
		СтрокаРНПТ.ИдентификаторСтроки = ?(НЕ ЗначениеЗаполнено(ИдПоКлючуСтроки), "", ИдПоКлючуСтроки);
	КонецЦикла;
КонецЕсли;
 
ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРНПТ_В_СоставеУслуг, ТЧ);
ВходящиеДанные.Вставить("СведенияПрослеживаемости", ТЧ);
// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-3229] КОНЕЦ

//Если НЕ Источник.Организация = Параметры.ОрганизацияВыгрузки Тогда
//	Отказ = Истина;
Если Источник.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.РеализацияОтгруженныхТоваров Тогда
	Отказ = Истина;
	// -- такие документы выгружаем по другому --
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), , "РеализацияОтгруженныхТоваров");
ИначеЕсли Найти(Источник.Комментарий, "Загружено из MSSQL") > 0 Тогда
	Отказ = Истина;
	ВыгрузитьПоПравилу(Источник, , Новый Структура("МожноВыгружать", Истина), ,"РеализацияТоваровУслуг");
ИначеЕсли Источник.Комментарий = "Сформировано обработкой переноса остатков" Тогда
	// документы, сформированнные для заведения остатков
Иначе	
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);
КонецЕсли;