// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-3229] НАЧАЛО
Если Объект.Товары.Количество() = 0  И Объект.Услуги.Количество() И Объект.СведенияПрослеживаемости.Количество() Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги;
КонецЕсли;
// 1СTeam Калмыков П.Н. 12.11.2024 [T1C-3229] КОНЕЦ

//склад и организация по умолчанию
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Объект);
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Товары");
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "ВозвратнаяТара");
Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "Услуги");
//Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, "АгентскиеУслуги"); //1СTeam Кузнецов Е.В. 23.07.2018 [18/T1C-699]

НомГруппаКассовыеАпп = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Кассовые аппараты");
Для Каждого текСтрока из Объект.Товары Цикл  	
	Если текСтрока.СчетДоходов = ПланыСчетов.Хозрасчетный.ПрочиеДоходы Тогда
		текСтрока.Субконто = Справочники.ПрочиеДоходыИРасходы.НайтиПоКоду("000000169"); 			
	КонецЕсли;  	   	
КонецЦикла;

Для Каждого СтрокаТЧ из Объект.СоставНабора Цикл  	
	СчетаУчета     = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Объект.Организация, СтрокаТЧ.Номенклатура, Объект.Склад);
	СтрокаТЧ.СчетУчета = СчетаУчета.СчетУчета;
	СтрокаТЧ.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
КонецЦикла;

Если Объект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности Тогда
	Для Каждого текСтрока из Объект.Товары Цикл
		текСтрока.ПереданныеСчетУчета = ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные; 		
	КонецЦикла;	
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);