Если Источник.ВидОперации = Перечисления.ВидыОперацийПоступлениеДопРасходов.ВнутреннийРасход Тогда
	Отказ = Истина
Иначе
	Если НЕ Источник.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом ИЛИ Источник.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		Отказ = Истина;
	КонецЕсли;
КонецЕсли;

ТипДокументаРасчетов = "ПоступлениеДопРасходов";
Если НЕ Отказ Тогда
	КоллекцияОбъектов = Источник.ДокументыРасчетовСКонтрагентом.Выгрузить();
	Выполнить(Алгоритмы.УдалитьСтрокиИзТабСНекоректнымТипомДокументовРасче);
КонецЕсли;