
СкладОтправитель = Неопределено;
СкладПолучатель = Неопределено;

Если ОбщегоНазначения.ЕстьРеквизитДокумента("СкладОтправитель", Источник.Метаданные()) Тогда
	СкладОтправитель = Источник.СкладОтправитель;
КонецЕсли;

Если ОбщегоНазначения.ЕстьРеквизитДокумента("СкладПолучатель", Источник.Метаданные()) Тогда
	СкладПолучатель = Источник.СкладПолучатель;
КонецЕсли;

Запрос = Новый Запрос;

Если ТипЗнч(СкладОтправитель) = Тип("СправочникСсылка.Склады") Тогда
	
	Значение = ?(ЗначениеЗаполнено(СкладОтправитель.СкладБУ), СкладОтправитель.СкладБУ, СкладОтправитель);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОрганизацииСкладовСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииСкладов.СрезПоследних(&Дата, Склад = &Склад) КАК ОрганизацииСкладовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Источник.Дата);
	Запрос.УстановитьПараметр("Склад", Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Отказ = Источник.Организация <> Выборка.Организация;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецЕсли;

Если ТипЗнч(СкладПолучатель) = Тип("СправочникСсылка.Склады") И НЕ Отказ Тогда
	
	Значение = ?(ЗначениеЗаполнено(СкладПолучатель.СкладБУ), СкладПолучатель.СкладБУ, СкладПолучатель);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОрганизацииСкладовСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииСкладов.СрезПоследних(&Дата, Склад = &Склад) КАК ОрганизацииСкладовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Источник.Дата);
	Запрос.УстановитьПараметр("Склад", Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Отказ = Источник.Организация <> Выборка.Организация;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецЕсли;