Если ТипЗнч(ОбъектКоллекции.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")
	ИЛИ ТипЗнч(ОбъектКоллекции.Сделка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
	ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Неопределено;
	Если Параметры.Свойство("ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю", ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю) Тогда
		Если ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.СчетНаОплатуПокупателю
			И ТипЗнч(ОбъектКоллекции.Сделка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			ИмяПКО = "СчетНаОплатуПокупателю";
		ИначеЕсли ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю = Перечисления.ВыгрузкаДокументовЗаказПокупателяСчетНаОплатуПокупателю.ЗаказПокупателя 
			И ТипЗнч(ОбъектКоллекции.Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")Тогда
			ИмяПКО = "ЗаказПокупателяСчетНаОплатуПокупателю";
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
Иначе
	 Отказ = Истина;
КонецЕсли;