ВЫБРАТЬ
	ВозвратТоваровПоставщикуТовары.НомерСтроки,
	ВозвратТоваровПоставщикуТовары.Номенклатура,
	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.Количество * ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.Коэффициент КАК ЧИСЛО(21, 6)) КАК Количество,
	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения,
	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмеренияМест,
	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.Коэффициент КАК ЧИСЛО(21, 6)) КАК Коэффициент,
	ВЫРАЗИТЬ(ВЫБОР
			КОГДА ВозвратТоваровПоставщикуТовары.Коэффициент > 0
				ТОГДА ВозвратТоваровПоставщикуТовары.Цена / ВозвратТоваровПоставщикуТовары.Коэффициент
			ИНАЧЕ ВозвратТоваровПоставщикуТовары.Цена
		КОНЕЦ КАК ЧИСЛО(17, 6)) КАК Цена,
	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.Сумма КАК ЧИСЛО(17, 4)) КАК Сумма,
	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	ВЫРАЗИТЬ(ВозвратТоваровПоставщикуТовары.СуммаНДС КАК ЧИСЛО(17, 4)) КАК СуммаНДС,
	ВозвратТоваровПоставщикуТовары.ХарактеристикаНоменклатуры,
	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры,
	ВозвратТоваровПоставщикуТовары.ДокументПоступления,
	ВозвратТоваровПоставщикуТовары.Заказ,
	ВозвратТоваровПоставщикуТовары.КоличествоМест,
	ВозвратТоваровПоставщикуТовары.Качество,
	ВозвратТоваровПоставщикуТовары.Склад,
	ВозвратТоваровПоставщикуТовары.КлючСвязи
ИЗ
	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
ГДЕ
	ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументСсылка