Если Параметры.АвтоЗачетОплаты Тогда
	Отказ = Истина; 	
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
	ИмяПКО = "ПриходныйКассовыйОрдер";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
	ИмяПКО = "ПлатежноеПоручениеВходящее";
ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств") Тогда
	ИмяПКО = "ПлатежныйОрдерПоступлениеДенежныхСредств";
Иначе
	Отказ = Истина;
КонецЕсли;