ВЫБРАТЬ
	Док.Ссылка                     КАК ДокументСсылка,
	Док.Ссылка.Номер,
	Док.Ссылка.Дата,
	Док.Ссылка.КонтрагентКредитор  КАК КонтрагентКредитор,
	NULL                           КАК КонтрагентДебитор,
	Док.Ссылка.Подразделение,
	Док.Ссылка.Комментарий,
	Док.Ссылка.Организация,
	Док.Ссылка.Ответственный,
	Док.ДоговорКонтрагента,
	Док.Сделка,
	0                              КАК ДебиторскаяЗадолженность,
	Док.Сумма                      КАК КредиторскаяЗадолженность,
	"Кредиторская"                 КАК ВидЗадолженности,
	Док.КурсВзаиморасчетов,
	"СписаниеЗадолженности"        КАК ВидОперации,
	Док.КратностьВзаиморасчетов
ИЗ
	Документ.КорректировкаДолга.СуммыДолга КАК Док
ГДЕ
	Док.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	И ((Док.Ссылка.Проведен
	И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	И (((&ДатаОкончания <> Неопределено И Док.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) 
	   ИЛИ (Док.Ссылка.Дата > &ДатаНачала))) И &Документ = Неопределено) ИЛИ (Док.Ссылка = &Документ))

ОБЪЕДИНИТЬ ВСЕ	

ВЫБРАТЬ
	Док.Ссылка                          КАК ДокументСсылка,
	Док.Ссылка.Номер,
	Док.Ссылка.Дата,
	NULL                                КАК КонтрагентКредитор,
	Док.Ссылка.КонтрагентДебитор        КАК КонтрагентДебитор,
	Док.Ссылка.Подразделение,
	Док.Ссылка.Комментарий,
	Док.Ссылка.Организация,
	Док.Ссылка.Ответственный,
	Док.ДоговорКонтрагента,
	Док.Сделка,
	Док.Сумма                           КАК ДебиторскаяЗадолженность,
	0    								КАК КредиторскаяЗадолженность,
	"Дебиторская"                       КАК ВидЗадолженности,
	Док.КурсВзаиморасчетов,
	"СписаниеЗадолженности"             КАК ВидОперации,
	Док.КратностьВзаиморасчетов
ИЗ
	Документ.КорректировкаДолга.СуммыДолга КАК Док
ГДЕ
	Док.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская)
	И ((Док.Ссылка.Проведен
	И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	И (((&ДатаОкончания <> Неопределено И Док.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) 
	   ИЛИ (Док.Ссылка.Дата > &ДатаНачала))) И &Документ = Неопределено) ИЛИ (Док.Ссылка = &Документ))
ИТОГИ СУММА(ДебиторскаяЗадолженность), СУММА(КредиторскаяЗадолженность) ПО ДокументСсылка, ВидОперации