	
	Если ТипЗнч(Источник.СубконтоУУ3) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ИмяПКО = "ПоступлениеТоваровУслуг";
	ИначеЕсли ТипЗнч(Источник.СубконтоУУ3) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеВходящее";
	ИначеЕсли ТипЗнч(Источник.СубконтоУУ3) = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
		ИмяПКО = "ПоступлениеДопРасходов";
	ИначеЕсли ТипЗнч(Источник.СубконтоУУ3) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеИсходящее";
	Иначе
		Отказ = Истина;
	КонецЕсли;