
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП.ВидНалоговИВзносовВБюджетПриемник КАК ВидНалоговИВзносовВБюджетПриемник
	|ИЗ
	|	РегистрСведений.кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП КАК кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП
	|ГДЕ
	|	кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП.КодЭлементаИсточник = &КодЭлементаИсточник
	|	И ВЫБОР
	|			КОГДА НЕ &УровеньБюджета = НЕОПРЕДЕЛЕНО
	|				ТОГДА кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП.УровеньБюджета = &УровеньБюджета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА НЕ &СчетУчетаДт = НЕОПРЕДЕЛЕНО
	|				ТОГДА кси_СопоставлениеСтатейДДСИНалоговВзносовПриОбменеУТБП.СчетУчета = &СчетУчетаДт
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("КодЭлементаИсточник"	, КодВидаНалоговогоОбязательства);
	Запрос.УстановитьПараметр("УровеньБюджета"		, УровеньБюджета);
	Запрос.УстановитьПараметр("СчетУчетаДт"			, Объект.СчетУчетаРасчетовСКонтрагентом); //1СTeam Еремкин И.А. 24.11.2020 [T1C-1678]

	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Объект.Налог = Выборка.ВидНалоговИВзносовВБюджетПриемник;
		
	КонецЕсли;