Если Источник.ВидОперации = Перечисления.ВидыОперацийППИсходящее.РасчетыПоКредитамИЗаймамСКонтрагентами Тогда
	
	Если Источник.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И Источник.Контрагент.Родитель.Код = "000003337"  Тогда //группа сотрудники
		КоллекцияОбъектов =  Источник.РасшифровкаПлатежа.Выгрузить(); 	
	КонецЕсли;
	
Иначе
	
	ТипДокументаРасчетов = "СписаниеСРасчетногоСчета";
	КоллекцияОбъектов = Источник.РасшифровкаПлатежа.Выгрузить();
	Выполнить(Алгоритмы.ОчиститьНекорректныеТипыДокументовРачетов);	
	
КонецЕсли