Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаРасчетовСКонтрагентом) И Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочееПоступление Тогда
	
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
КонецЕсли;

Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.РасчетыПоКредитамИЗаймам) Тогда
		
		СтруктураСчетов = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
				Объект.Организация,
				Объект.Контрагент,
				СтрокаПлатеж.ДоговорКонтрагента
		);
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя; // Обычно 62.01
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансовПокупателя; // Обычно 62.02
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов; // Обычно 60.01
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансов; // Обычно 60.02
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты Тогда
			Если Объект.ОтражатьРазницуВКурсеВСоставеОперационныхРасходов Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
			Иначе
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			КонецЕсли;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажиИностраннойВалюты Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
		КонецЕсли;
		
	КонецЕсли;
КонецЦикла;

Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПоступленияОтПродажПоПлатежнымКартамИБанковскимКредитам Тогда
	
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ИздержкиОбращения;
	
КонецЕсли;

ИмяРеквизита = "СчетБанк";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);

Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ПриобретениеИностраннойВалюты Тогда
	Объект.РасшифровкаПлатежа[0].СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
	ОтражатьРазницуВКурсеВСоставеОперационныхРасходов = Истина;
КонецЕсли;

Выполнить(Алгоритмы.ПровестиДокумент);