
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаДолгаСуммыДолга.СчетДт КАК СчетДт,
	|	КорректировкаДолгаСуммыДолга.СчетКт КАК СчетКт,
	|	КорректировкаДолгаСуммыДолга.СубконтоДт1 КАК ВидПлатежаВБюджет,
	|	КорректировкаДолгаСуммыДолга.СубконтоДт2 КАК УровеньБюджета,
	|	КорректировкаДолгаСуммыДолга.СубконтоДт3 КАК СтатьяЗатрат,
	|	КорректировкаДолгаСуммыДолга.кси_РегистрацияВНалоговомОрганеДт КАК РегистрацияВНалоговомОргане,
	|	КорректировкаДолгаСуммыДолга.СубконтоКт1 КАК Контрагент,
	|	КорректировкаДолгаСуммыДолга.СубконтоКт2 КАК ДоговорКонтрагента,
	|	КорректировкаДолгаСуммыДолга.СубконтоКт3 КАК ДокументРеализации,
	|	КорректировкаДолгаСуммыДолга.СуммаРегл КАК Сумма,
	|	КорректировкаДолгаСуммыДолга.Ссылка.Дата КАК Дата,
	|	ВЫРАЗИТЬ(КорректировкаДолгаСуммыДолга.Ссылка.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	КорректировкаДолгаСуммыДолга.Ссылка.Организация КАК Организация,
	|	КорректировкаДолгаСуммыДолга.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫРАЗИТЬ(КорректировкаДолгаСуммыДолга.Ссылка.Комментарий КАК СТРОКА(1000)) КАК Содержание,
	|	""Вручную"" КАК СпособЗаполнения,
	|	КорректировкаДолгаСуммыДолга.Ссылка КАК Документ,
	|	ИСТИНА КАК Активность,
	|	КорректировкаДолгаСуммыДолга.Ссылка.Дата КАК Период,
	|	КорректировкаДолгаСуммыДолга.СуммаРегл КАК СуммаНУКт,
	|	ВЫБОР
	|		КОГДА КорректировкаДолгаСуммыДолга.Ссылка.ВалютаДокумента <> ВалютаРегламентированногоУчета.Значение
	|			ТОГДА КорректировкаДолгаСуммыДолга.Ссылка.ВалютаДокумента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА КорректировкаДолгаСуммыДолга.Ссылка.ВалютаДокумента <> ВалютаРегламентированногоУчета.Значение
	|			ТОГДА КорректировкаДолгаСуммыДолга.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВалютнаяСуммаКт,
	|	ВалютаРегламентированногоУчета.Значение КАК Значение
	|ИЗ
	|	Документ.КорректировкаДолга.СуммыДолга КАК КорректировкаДолгаСуммыДолга,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ГДЕ
	|	КорректировкаДолгаСуммыДолга.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Документ";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);

РезультатЗапроса = Запрос.Выполнить();

Если НЕ РезультатЗапроса.Пустой() Тогда
	
	ТаблицаПроводок = РезультатЗапроса.Выгрузить();
	ТаблицаПроводок.Очистить();
	
	ТаблицаПроводок.Колонки.Добавить("СубконтоДт");
	ТаблицаПроводок.Колонки.Добавить("СубконтоКт");
	ТаблицаПроводок.Колонки.Добавить("СуммаПРДт");
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СуммаОперации = 0;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		ВходящиеДанные = Новый Структура("Хозрасчетный, СуммаОперации");
		КлючВыгружаемыхДанных = Источник.Ссылка;
		
		ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// 1СTeam Калмыков П.Н. 26.11.2024 [T1C-3909] НАЧАЛО
			Если ВыборкаДетальныеЗаписи.СчетДт.Код = "000" И ТипЗнч(ВыборкаДетальныеЗаписи.Контрагент) = Тип("СправочникСсылка.Контрагенты")
				И ВыборкаДетальныеЗаписи.Контрагент.НеЯвляетсяРезидентом Тогда
				Отказ = Истина;
				Прервать;
			КонецЕсли;
			// 1СTeam Калмыков П.Н. 26.11.2024 [T1C-3909] КОНЕЦ
			
			НовСтрока = ТаблицаПроводок.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);
			
			СубконтоДт = Новый Соответствие;
			//1СTeam Карпухин Д.С. 24.02.2022 [T1C-2003] НАЧАЛО 
			Если ВыборкаДетальныеЗаписи.СчетДт.Код = "91.02" Тогда
				СубконтоДт.Вставить(Новый Структура("Код", "00013"), ВыборкаДетальныеЗаписи.СтатьяЗатрат); // Статьи затрат
				СубконтоДт.Вставить(Новый Структура("Код", "00055"), ВыборкаДетальныеЗаписи.Контрагент); // Реализуемые активы
				НовСтрока.СуммаПРДт = ВыборкаДетальныеЗаписи.Сумма;
			Иначе
			//1СTeam Карпухин Д.С. 24.02.2022 [T1C-2003] КОНЕЦ 
				СубконтоДт.Вставить(Новый Структура("Код", "00022"), ВыборкаДетальныеЗаписи.ВидПлатежаВБюджет); // Виды платежей в бюджет (фонды)
				СубконтоДт.Вставить(Новый Структура("Код", "00025"), ВыборкаДетальныеЗаписи.УровеньБюджета); // Уровни бюджетов
				СубконтоДт.Вставить(Новый Структура("Код", "00057"), ВыборкаДетальныеЗаписи.РегистрацияВНалоговомОргане); // Регистрация в налоговом органе
			//1СTeam Карпухин Д.С. 24.02.2022 [T1C-2003] НАЧАЛО 
			КонецЕсли;
			//1СTeam Карпухин Д.С. 24.02.2022 [T1C-2003] КОНЕЦ 

			НовСтрока.СубконтоДт = СубконтоДт;
			
			СубконтоКт = Новый Соответствие;
			СубконтоКт.Вставить(Новый Структура("Код", "00005"), ВыборкаДетальныеЗаписи.Контрагент); // Контрагенты
			СубконтоКт.Вставить(Новый Структура("Код", "00016"), ВыборкаДетальныеЗаписи.ДоговорКонтрагента); // Договоры
			СубконтоКт.Вставить(Новый Структура("Код", "00039"), ВыборкаДетальныеЗаписи.ДокументРеализации); // Документы расчетов с контрагентом
			
			НовСтрока.СубконтоКт = СубконтоКт;
			
			СуммаОперации = СуммаОперации + ВыборкаДетальныеЗаписи.СуммаНУКт;
			
		КонецЦикла;
		
		ВходящиеДанные.Хозрасчетный 	= ТаблицаПроводок;
		ВходящиеДанные.СуммаОперации 	= СуммаОперации;
		
	КонецЦикла;
	
КонецЕсли;

Параметры.Вставить("ТаблицаПроводок", ТаблицаПроводок);