Если Параметры.АвтоЗачетОплаты Тогда
	Значение = "Автоматически";
ИначеЕсли Источник.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
	Значение = "НеЗачитывать";
ИначеЕсли Источник.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом Тогда
	ТипДокументаРасчетов = "РеализацияТоваровУслуг";
	КоллекцияОбъектов = Источник.ДокументыРасчетовСКонтрагентом.Выгрузить();
	Выполнить(Алгоритмы.УдалитьСтрокиИзТабСНекоректнымТипомДокументовРасче);
	Если КоллекцияОбъектов.Количество() > 0 Тогда
		Значение = "ПоДокументу";
	Иначе
		Значение = "НеЗачитывать";
	КонецЕсли;
Иначе
	Значение = "Автоматически";
КонецЕсли;