
//1СTeam Еремкин И.А. 18.01.2021 [T1C-1815] НАЧАЛО 
МассивДДС = кси_ОбщийМодульПовторногоИспользования.ПолучитьЗначениеНастройки("НастройкиДляОбменаУТБП", "СтатьиДДС", Истина);

Отказ = Истина;

Для Каждого СтрокаПлатежа Из Источник.РасшифровкаПлатежа Цикл
	
	Если НЕ МассивДДС.Найти(СтрокаПлатежа.СтатьяДвиженияДенежныхСредств) = Неопределено Тогда
		
		Отказ = Ложь;
		
		Прервать;
		
	КонецЕсли;
	
КонецЦикла;

Если НЕ Отказ И ЗначениеЗаполнено(Источник.ПоказательПериода) Тогда
	
	МассивПодстрок = СтрРазделить(Источник.ПоказательПериода, ".");
	
	ПериодичностьНалога = МассивПодстрок[0];
	НомерПериода 		= МассивПодстрок[1];
	ГодПериода 			= МассивПодстрок[2];
	
	Если ПериодичностьНалога = "МС" Тогда
		
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", НомерПериода, ГодПериода));	
		
	ИначеЕсли ПериодичностьНалога = "КВ" Тогда
		
		МесяцНачалаКвартала = "";
		
		Если НомерПериода = "04" Тогда
			
			МесяцНачалаКвартала = "10"; 
			
		ИначеЕсли НомерПериода = "03" Тогда
			
			МесяцНачалаКвартала = "07";
			
		ИначеЕсли НомерПериода = "02" Тогда
			
			МесяцНачалаКвартала = "04";
			
		Иначе 
			
			МесяцНачалаКвартала = "01";
			
		КонецЕсли;
		
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", МесяцНачалаКвартала, ГодПериода));	
		
	ИначеЕсли ПериодичностьНалога = "ПЛ" Тогда
		
		МесяцНачалаПолугодия = "";
		
		Если НомерПериода = "02" Тогда
			
			МесяцНачалаПолугодия = "07"; 
			
		Иначе
			
			МесяцНачалаПолугодия = "01";	
			
		КонецЕсли;
		
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.%1.%2", МесяцНачалаПолугодия, ГодПериода));
		
	ИначеЕсли ПериодичностьНалога = "ГД" Тогда
		
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("01.01.%1", ГодПериода));
		
	Иначе
		
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрШаблон("%1.%2.%3", ПериодичностьНалога, НомерПериода, ГодПериода));
		
	КонецЕсли;
	
КонецЕсли;
//1СTeam Еремкин И.А. 18.01.2021 [T1C-1815] КОНЕЦ