
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка КАК Ссылка
|ИЗ
|	Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
|ГДЕ
|	СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = &СчетЗатрат
|	И СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации = &Подразделение
|	И СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1 = &СтатьяЗатрат";

Запрос.УстановитьПараметр("СчетЗатрат"		,НайденнаяСтрока.СчетУчетаЗатрат);
Запрос.УстановитьПараметр("Подразделение"	,Объект.Местонахождение);
Запрос.УстановитьПараметр("СтатьяЗатрат"	,НайденнаяСтрока.СтатьяЗатрат);

РезультатЗапроса = Запрос.Выполнить();

Если НЕ РезультатЗапроса.Пустой() Тогда
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЗ.СпособОтраженияРасходов = Выборка.Ссылка;
	КонецЦикла;
	
КонецЕсли;