КоллекцияОбъектов = Источник.Товары.Выгрузить();
СтрокиКУдалению = Новый Массив();
ТаблицаСоставНабора = КоллекцияОбъектов.СкопироватьКолонки();
Для каждого СтрокаТовары Из КоллекцияОбъектов Цикл
	Если СтрокаТовары.Номенклатура.ВидНоменклатуры.Наименование = "Набор" Тогда
		СтрокиКУдалению.Добавить(СтрокаТовары);
		ТаблицаСоставНабора.Очистить();
		ЗначениеСтавкиНДС = Ценообразование.ПолучитьСтавкуНДС(СтрокаТовары.СтавкаНДС);			
		МассивСтрок = Источник.СоставНабора.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаТовары.КлючСтроки));
		Для каждого СтрокаСоставНабора из МассивСтрок Цикл
			НоваяСтрока = ТаблицаСоставНабора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСоставНабора);
			НоваяСтрока.Количество = НоваяСтрока.Количество * СтрокаТовары.Количество;
			НоваяСтрока.СтавкаНДС = СтрокаТовары.СтавкаНДС;
			НоваяСтрока.СуммаНДС = НоваяСтрока.Количество * НоваяСтрока.Цена * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена - НоваяСтрока.СуммаНДС;
			НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество));
			НоваяСтрока.Коэффициент = СтрокаТовары.Коэффициент;
		КонецЦикла;
		Разница = ТаблицаСоставНабора.Итог("Сумма") - СтрокаТовары.Сумма;
		РазницаНДС = ТаблицаСоставНабора.Итог("СуммаНДС") - СтрокаТовары.СуммаНДС;
		Если Разница <> 0 И Цел(Разница) = 0 Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма - Разница;
			НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество));
		КонецЕсли;
		Если РазницаНДС <> 0 И Цел(РазницаНДС) = 0 Тогда
			НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС - РазницаНДС; 			
		КонецЕсли;

		Для каждого СтрокаСоставНабора из ТаблицаСоставНабора Цикл
			НоваяСтрока = КоллекцияОбъектов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСоставНабора);	
		КонецЦикла;	
	КонецЕсли;	
КонецЦикла;  

Для каждого СтрокаТовары из СтрокиКУдалению Цикл
	КоллекцияОбъектов.Удалить(СтрокаТовары);
КонецЦикла;

Для каждого СтрокаТЧ Из КоллекцияОбъектов цикл
	СтрокаТЧ.Количество       = СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент;
	СтрокаТЧ.Цена             = СтрокаТЧ.Цена / ?(СтрокаТЧ.Коэффициент = 0, 1, СтрокаТЧ.Коэффициент);
КонецЦикла;