// 1СTeam Фасхетдинов Д.М. 11.03.2022 [T1C-2166] НАЧАЛО
Если НЕ ПустаяСтрока(ОбъектКоллекции.ИдентификаторСтроки) Тогда
	
	НайденнаяСтрока = Источник.МалоценноеОборудование.Найти(ОбъектКоллекции.ИдентификаторСтроки);	
	Если ЗначениеЗаполнено(НайденнаяСтрока) И ЗначениеЗаполнено(НайденнаяСтрока.СчетЗатрат) Тогда
		
		Если Лев(НайденнаяСтрока.СчетЗатрат.Код, 2) = "20" Тогда
			Значение = НайденнаяСтрока.СтатьяЗатрат;
			ИмяПКО = "СтатьиЗатрат";
		Иначе
			Пусто = Истина;
		КонецЕсли;
		
	Иначе
		Пусто = Истина;			
	КонецЕсли;
	
Иначе
	Пусто = Истина;	
КонецЕсли;
// 1СTeam Фасхетдинов Д.М. 11.03.2022 [T1C-2166] КОНЕЦ