Параметры.АвтоЗачетОплаты = ЗначениеЗаполнено(Параметры.СобственныеКонтрагенты.Найти(Источник.Контрагент,"Контрагент"));

Если Не Источник.Организация.ОтражатьВРегламентированномУчете Тогда
	Отказ = Истина;
ИначеЕсли Источник.Комментарий = "Сформировано обработкой переноса остатков"
	и Источник.Организация = Параметры.ОрганизацияВыгрузки Тогда
	// документы, сформированнные для заведения остатков
ИначеЕсли Не Источник.Оплачено Тогда
	Отказ = Истина;
Иначе
	Выполнить(Алгоритмы.МожноВыгружатьДокумент);
КонецЕсли;