Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаРасчетовСКонтрагентом) И Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочееСписание Тогда
	
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.Вспомогательный;
	
КонецЕсли;

ПараметрыРасшифровкаПлатежа = ПараметрыОбъекта["РасшифровкаПлатежаТабличнаяЧасть"]; 


Для каждого СтрокаПлатеж Из Объект.РасшифровкаПлатежа Цикл
	
	СтруктураСчетов = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(
				Объект.Организация,
				Объект.Контрагент,
				СтрокаПлатеж.ДоговорКонтрагента
		);
			
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
			Если СтрокаПлатеж.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовСКомитентом;
			Иначе
				СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
			КонецЕсли;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансов;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтруктураСчетов.СчетАвансовПокупателя;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочиеРасчетыСКонтрагентами Тогда
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетов;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.РасчетыПоКредитамИЗаймам Тогда	
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтруктураСчетов.СчетРасчетовПокупателя;
		Иначе
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом    = СтруктураСчетов.СчетРасчетов;
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам        = СтруктураСчетов.СчетАвансов;
		КонецЕсли;
	
	НайденнаяСтрока = ПараметрыРасшифровкаПлатежа[Объект.РасшифровкаПлатежа.Индекс(СтрокаПлатеж)];
	КодВидаНалоговогоОбязательства = НайденнаяСтрока.КодВидаНалоговогоОбязательства;
	УровеньБюджета = Неопределено;
	
	Если Объект.СубконтоДт2 = Перечисления.УровниБюджетов.ФедеральныйБюджет Или Объект.СубконтоДт2 = Перечисления.УровниБюджетов.РегиональныйБюджет Тогда
		УровеньБюджета = Объект.СубконтоДт2;
	КонецЕсли;
	
	Выполнить(Алгоритмы.ЗаполнитьВидНалоговогоОбязательства);
	
КонецЦикла;

ИмяРеквизита = "СчетБанк";
Выполнить(Алгоритмы.СтандартныеОперацииДляПлатежныхДокументов);

//мВалютаРегламентированногоУчета = Параметры.ВалютаРегламентированногоУчета;
//Если Объект.СчетОрганизации.ВалютаДенежныхСредств <> мВалютаРегламентированногоУчета Тогда
//	Объект.СчетБанк = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
//КонецЕсли;

// -- перечисление денег на покупку валюты --
Если Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств.Код = "000000180" Тогда
	Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты;
	Объект.СубконтоДт1 = Объект.Контрагент;
	Объект.СубконтоДт2 = Объект.РасшифровкаПлатежа[0].ДоговорКонтрагента;
КонецЕсли;

// Чтобы не было проведенных с неподцепленными ведомостями
Если Объект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП Тогда
	Если НЕ Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа") = Объект.СуммаДокумента Тогда
		//Предупреждение("Не совпадают сумма документа и общая сумма к выплате по платежным ведомостям.");
		Объект.Проведен = Ложь;
	КонецЕсли;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) И Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
	Объект.СтатьяДвиженияДенежныхСредств = Объект.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	Если ЗначениеЗаполнено(Объект.СтатьяДвиженияДенежныхСредств) Тогда
		Если Объект.СтатьяДвиженияДенежныхСредств.Код = "000000084" Тогда
			Объект.Налог = Справочники.ВидыНалоговИПлатежейВБюджет.НайтиПоКоду("000000002");
		КонецЕсли;
	КонецЕсли;
КонецЕсли;

//1СTeam Еремкин И.А. 09.02.2021 [T1C-1678] НАЧАЛО 
Если Объект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента Тогда  //68.32
	
	НовСтрока = Объект.НалоговыйАгентНДС.Добавить();
	
	НовСтрока.Контрагент 		= Объект.СубконтоДт1;
	НовСтрока.Договор 			= Объект.СубконтоДт2;
	НовСтрока.ДокументРасчетов 	= Объект.СубконтоДт3;
	НовСтрока.Сумма 			= Объект.СуммаДокумента;
	
	// 1СTeam Еремкин И.А. 04.05.2021 [T1C-1996] НАЧАЛО 
	Если НЕ ЗначениеЗаполнено(Объект.ВидНалоговогоОбязательства) Тогда
		Объект.ВидНалоговогоОбязательства  = Перечисления.ВидыПлатежейВГосБюджет.Налог;
	КонецЕсли;
	// 1СTeam Еремкин И.А. 04.05.2021 [T1C-1996] КОНЕЦ
	
КонецЕсли;


Выполнить(Алгоритмы.ПровестиДокумент);