Если Параметры.АвтоЗачетОплаты Тогда
	Отказ = Истина; 	
ИначеЕсли ОбъектКоллекции.ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом И ЗначениеЗаполнено(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) Тогда
	Отказ = Ложь;
	Если ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ИмяПКО = "ПоступлениеТоваровУслуг";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеВходящее";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
		ИмяПКО = "ПоступлениеДопРасходов";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		ИмяПКО = "ПлатежноеПоручениеИсходящее";
	ИначеЕсли ТипЗнч(ОбъектКоллекции.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.КорректировкаДолга") Тогда //1СTeam Карпенко Е.В. 07.09.2021 []
		ИмяПКО = "КорректировкаДолга";
	КонецЕсли;	
Иначе
	Отказ = Истина;
КонецЕсли;