	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		ПодразделениеВозврат = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрОрганизация) Тогда
		ПодразделениеВозврат = ПараметрСклад.ПодразделениеОрганизации;
	КонецЕсли;
	
	ПодразделениеОрганизации = ПараметрСклад.ПодразделениеОрганизации;
	
	Если ПодразделениеОрганизации.Владелец = ПараметрОрганизация Тогда
		ПодразделениеВозврат = ПодразделениеОрганизации;
	Иначе
		ПодразделениеВозврат = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;