  ВЫБРАТЬ
	СписаниеТоваровТовары.НомерСтроки,
	СписаниеТоваровТовары.ДокументРезерва,
	СписаниеТоваровТовары.ЕдиницаИзмерения,
	СписаниеТоваровТовары.ЕдиницаИзмеренияМест,
	СписаниеТоваровТовары.Качество,
	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.ЕдиницаИзмерения.Коэффициент  КАК Количество,
	СписаниеТоваровТовары.КоличествоМест,
	СписаниеТоваровТовары.Коэффициент, 
	СписаниеТоваровТовары.Номенклатура,
	СписаниеТоваровТовары.СерияНоменклатуры,
	СписаниеТоваровТовары.Сумма  КАК Сумма,
	СписаниеТоваровТовары.ХарактеристикаНоменклатуры,
	СписаниеТоваровТовары.Цена КАК Цена
ИЗ
	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
ГДЕ
	СписаниеТоваровТовары.Ссылка = &ДокументСсылка