
НомерИсточника = СокрЛП(Источник.Номер);

Если СтрДлина(НомерИсточника) < 9 Тогда
	// номер источника спокойно влезит в номер документа "Корректировка долга"
	НовыйНомер = НомерИсточника;
Иначе
	// номер не влезает, попытаемся получить его числовую составляющую
	ПрефиксОрганизации = СокрЛП(Источник.Организация.Префикс);
    ДлинаПрефиксаОрганизации = СтрДлина(ПрефиксОрганизации);
	
	ЧисловойНомер = Сред(НомерИсточника, ДлинаПрефиксаОрганизации + 1);
	
	НеПолученЧисловойКод = Истина;
	Пока НеПолученЧисловойКод Цикл
		Попытка
			ЧисловойНомер = Число(ЧисловойНомер);
			НеПолученЧисловойКод = Ложь;
		Исключение
			Если СтрДлина(ЧисловойНомер) = 1 Тогда
				// не удалось получить числовой номер, возвращаем что можем
				ЧисловойНомер = Сред(НомерИсточника, ДлинаПрефиксаОрганизации + 3);
				НеПолученЧисловойКод = Ложь;
			Иначе
				ЧисловойНомер = Сред(ЧисловойНомер, 2);
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
	
	НовыйНомер = Формат(ЧисловойНомер, "ЧГ=0");
	
	Пока СтрДлина(НовыйНомер) < 9 - ДлинаПрефиксаОрганизации Цикл
		НовыйНомер = "0" + НовыйНомер;
	КонецЦикла;
	
	НовыйНомер = ПрефиксОрганизации + НовыйНомер;
	
КонецЕсли;
	
Значение = "_" + ПрефиксДокумента + НовыйНомер;