ВладелецКонтактнойИнформации = Объект.Отбор.Объект.Значение;

Если ТипЗнч(ВладелецКонтактнойИнформации) = Тип("СправочникСсылка.Организации") Тогда
	ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации,,,, "Организации");
ИначеЕсли ТипЗнч(Объект.Отбор.Объект.Значение) = Тип("СправочникСсылка.Пользователи") Тогда
	//ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации,,,, "Пользователи");
ИначеЕсли ТипЗнч(ВладелецКонтактнойИнформации) = Тип("СправочникСсылка.Контрагенты") Тогда
	ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации,,,, "Контрагенты");
ИначеЕсли ТипЗнч(ВладелецКонтактнойИнформации) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
	
	Запросы.НаличиеКонтактныхЛицКонтрагента.УстановитьПараметр("КонтактноеЛицо", ВладелецКонтактнойИнформации);
	
	РезультатЗапросаПоКонтактнымЛицам = Запросы.НаличиеКонтактныхЛицКонтрагента.Выполнить();
	
	Если НЕ РезультатЗапросаПоКонтактнымЛицам.Пустой() Тогда
		ВыборкаПоКонтактнымЛицам = РезультатЗапросаПоКонтактнымЛицам.Выбрать();
		ВыборкаПоКонтактнымЛицам.Следующий();
		ВходящиеДанные  = Новый Структура("ВидКонтактногоЛица, ОбъектВладелец, Должность, Роль, КонтактноеЛицоКонтрагента");
		ВходящиеДанные.ОбъектВладелец = ВыборкаПоКонтактнымЛицам.ОбъектВладелец;
		ВходящиеДанные.ВидКонтактногоЛица = Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента;
		ВходящиеДанные.Должность = ВыборкаПоКонтактнымЛицам.Должность;
		ВходящиеДанные.Роль = ВыборкаПоКонтактнымЛицам.Роль;
		ВходящиеДанные.КонтактноеЛицоКонтрагента = ВыборкаПоКонтактнымЛицам.КонтактноеЛицо;
	Иначе
		ВходящиеДанные = Новый Структура;
		ВходящиеДанные.Вставить("ОбъектВладелец", Неопределено);
		ВходящиеДанные.Вставить("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт);
		ВходящиеДанные.Вставить("Должность", Неопределено);
		ВходящиеДанные.Вставить("Роль", Неопределено);
		ВходящиеДанные.Вставить("КонтактноеЛицоКонтрагента", Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка());
	КонецЕсли;
	ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации, ,ВходящиеДанные, ,"КонтактныеЛица");
	
ИначеЕсли ТипЗнч(ВладелецКонтактнойИнформации) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
	ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации,,,, "ФизическиеЛица");
ИначеЕсли ТипЗнч(ВладелецКонтактнойИнформации) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
	
	ВходящиеДанные = Новый Структура;
	ВходящиеДанные.Вставить("ОбъектВладелец", ВладелецКонтактнойИнформации.Владелец);
	ВходящиеДанные.Вставить("ВидКонтактногоЛица", Перечисления.ВидыКонтактныхЛиц.КонтактноеЛицоКонтрагента);
	ВходящиеДанные.Вставить("Должность", ВладелецКонтактнойИнформации.Должность);
	ВходящиеДанные.Вставить("Роль", ВладелецКонтактнойИнформации.РольКонтактногоЛица);
	ВходящиеДанные.Вставить("КонтактноеЛицоКонтрагента", ВладелецКонтактнойИнформации.Ссылка);
	
	ВыгрузитьПоПравилу(ВладелецКонтактнойИнформации.КонтактноеЛицо, ,ВходящиеДанные, ,"КонтактныеЛица");
	
КонецЕсли;

Отказ = Истина;