Если Источник.ВидОперации = Перечисления.ксВидыОперацийТребованиеНакладная.Производство Тогда
	Значение = ПланыСчетов.ПланСчетовБУ.НайтиПоКоду("20.02");	
ИначеЕсли ЗначениеЗаполнено(ОбъектКоллекции.СтатьяЗатрат) и ЗначениеЗаполнено(Источник.Подразделение) Тогда
	СтатьяЗатрат = ОбъектКоллекции.СтатьяЗатрат;
	Если Источник.Организация.Префикс = "ЦТ" И ОбъектКоллекции.СтатьяЗатрат.Код = "000000233" Тогда //Расходы на гарантийный ремонт для покупателей
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоКоду("000000049"); //Материальные расходы
	КонецЕсли;
	Значение = ксОбщийМодуль.ПолучитьСчетЗатрат(СтатьяЗатрат, Источник.Подразделение, "СчетБУ");
Иначе
	Значение = "";
КонецЕсли;